{
  "HomePage": {
    "title": "ছবির রঙ বদল টুল - বিনামূল্যে অনলাইন রঙ সম্পাদক",
    "originalImages": "মূল ছবিগুলি",
    "processedImages": "প্রক্রিয়াকৃত ছবিগুলি",
    "previewButton": "পূর্বরূপ",
    "downloadButton": "ডাউনলোড",
    "description": "পেশাদার অনলাইন ছবির রঙ বদল টুল, একাধিক রঙ একসাথে পরিবর্তন করুন, ব্যাছ ছবি প্রক্রিয়াকরণ করুন। কোন আপলোড ছাড়াই ব্রাউজারে স্থানীয়ভাবে প্রক্রিয়া করুন। ডিজাইনার, ই-কমার্স ব্যবসায়ী এবং কন্টেন্ট ক্রিয়েটরদের জন্য আদর্শ।",
    "keywords": "ছবির রঙ পরিবর্তন,অনলাইন ছবি সম্পাদনা,রঙ পরিবর্তন টুল,ব্যাছ ছবি প্রক্রিয়াকরণ,ছবি এডিটর,ফটো এডিটিং,বিনামূল্যে ছবি সম্পাদক,ফটোশপ অনলাইন,ব্যাকগ্রাউন্ড রিমুভার,ডিজাইন টুল"
  },
  "Header": {
    "title": "রঙ বদল",
    "subtitle": "পেশাদার অনলাইন ছবির রঙ বদল টুল",
    "home": "হোম",
    "settings": "সেটিংস",
    "about": "সম্পর্কে"
  },
  "ColorReplaceSettings": {
    "title": "রঙ বদল সেটিংস",
    "addColorPair": "রঙ জোড়া যোগ করুন",
    "colorPairTitle": "রঙ জোড়া #{id}",
    "removeColorPair": "এই রঙ জোড়া মুছে দিন",
    "sourceColor": "সোর্স রঙ",
    "targetColor": "লক্ষ্য রঙ",
    "toleranceLabel": "রঙ মিল সহনশীলতা: {value}%",
    "emptyState": "কোন রঙ বদল নিয়ম নেই। শুরু করতে \"রঙ জোড়া যোগ করুন\" এ ক্লিক করুন",
    "toleranceTitle": "রঙ মিল সহনশীলতা",
    "toleranceLow": "সঠিক",
    "toleranceHigh": "অনুরূপ",
    "replace": "বদল",
    "download": "ডাউনলোড",
    "clearFiles": "ছবিগুলি মুছুন"
  },
  "ColorPicker": {
    "transparent": "স্বচ্ছ",
    "useTransparent": "স্বচ্ছ ব্যবহার করুন",
    "useColor": "রঙ ব্যবহার করুন"
  },
  "EyeDropper": {
    "tooltip": "রঙ পিকার ব্যবহার করুন"
  },
  "ToolDescription": {
    "title": "বিনামূল্যে অনলাইন ছবির রঙ বদল টুল",
    "mainDescription": "আপনার ছবিগুলিকে তৎক্ষণাৎ পেশাদার রঙ বদল টুল দ্বারা রূপান্তরিত করুন। ডিজাইনার, মার্কেটার এবং কন্টেন্ট নির্মাতাদের জন্য সম্পূর্ণ যারা দ্রুত এবং দক্ষভাবে ছবির রঙ পরিবর্তন করতে চান। আপনি যদি পণ্য ভেরিয়েন্ট তৈরি করছেন, ব্রান্ড রঙ সামঞ্জস্য করছেন, বা ডিজাইন বিকল্পগুলি পরীক্ষা করছেন, আমাদের টুল ছবির গুণমান সংরক্ষণ করে সঠিক রঙ পরিবর্তন সরবরাধ করে - সবই সরাসরি আপনার ব্রাউজারে, কোন আপলোড ছাড়াই।",
    "features": {
      "title": "ছবি রঙ সম্পাদনার জন্য পেশাদার বৈশিষ্ট্যাবলী",
      "feature1": {
        "title": "স্মার্ট রঙ বদল প্রযুক্তি",
        "description": "আপনার ছবিগুলিতে যেকোন রঙ পিক্সেল-সম্পূর্ণ সটিকতার সাথে বদল করুন। আমাদের উন্নত রঙ মিল অ্যালগরিদম মসৃণ পরিবর্তন এবা পেশাদার-দেখতে ফলাফল নিশ্চিত করে, পণ্য ফটো এবা ডিজাইন সম্পদের জন্য সম্পূর্ণ।"
      },
      "feature2": {
        "title": "বহু-রঙ বদল",
        "description": "একই সাথে বহু রঙ বদল করে সময় বাঁচান। ব্রান্ড রঙ আপডেট, থিম পরিবর্তন এবা পণ্য ভেরিয়েশন তৈরির জন্য আদর্শ। সম্পূর্ণ রঙ স্কিমগুলি একবারে রূপান্তরিত করতে বহু রঙ জোড়া যোগ করুন।"
      }
    }
  },
  "UsageExamples": {
    "title": "ব্যবহারের উদাহরণ",
    "description": "রঙ বদল টুল ব্যবহার করার কিছু উদাহরণ এখানে রয়েছে:",
    "before": "আগে",
    "after": "পরে"
  },
  "Metadata": {
    "title": "রঙ বদল - বিনামূল্যে অনলাইন ছবির রঙ বদল টুল",
    "titleTemplate": "%s | রঙ বদল - বিনামূল্যে অনলাইন ছবির রঙ বদল টুল",
    "description": "বিনামূল্যে অনলাইন টুল যা ছবির রঙ পরিবর্তনের জন্য সঠিক সমাধান সরবরাধ করে। একই সাথে বহু রঙ বদল করুন, ছবিগুলি ব্যাছ প্রক্রিয়া করুন, এবা ছবির গুণমান বজায় রাখুন। কোন আপলোড প্রয়োজন নেই - সমস্ত প্রক্রিয়া আপনার ব্রাউজারে সম্পন্ন হয়।",
    "keywords": "রঙ বদল, ছবি রঙ সম্পাদক, রঙ বদল টুল, ব্যাছ ছবি প্রক্রিয়াকরণ, ছবি রঙ পরিবর্তনকারী, রঙ বদল টুল, ছবি সম্পাদনা, ডিজাইন টুল",
    "locale": "bn_BD",
    "ogTitle": "রঙ বদল - বিনামূল্যে অনলাইন ছবির রঙ বদল টুল",
    "ogDescription": "আমাদের শক্তিশালী রঙ বদল টুল দিয়ে আপনার ছবিগুলিকে রূপান্তরিত করুন। বহু রঙ বদল করুন, ছবিগুলি ব্যাছ প্রক্রিয়া করুন, এবা গুণমান বজায় রাখুন। কোন আপলোড প্রয়োজন নেই - সমস্ত প্রক্রিয়া আপনার ব্রাউজারে সম্পন্ন হয়।",
    "ogImageAlt": "রঙ বদল টুল ইন্টারফেস",
    "twitterTitle": "রঙ বদল - বিনামূল্যে অনলাইন ছবির রঙ বদল টুল",
    "twitterDescription": "আমাদের রঙ বদল টুল দিয়ে ছবিগুলিকে দ্রুত এবং সহজে রূপান্তরিত করুন। বহু রঙ বদল, ব্যাছ প্রক্রিয়া, এবা উচ্চ গুণমান - সবই আপনার ব্রাউজারে।"
  },
  "ImageProcessor": {
    "dropToUpload": "ছবি আপলোড করতে ছেড়ে দিন",
    "dragAndDrop": "এখানে ছবি টেনে আনুন, অথবা আপলোড করতে ক্লিক করুন",
    "supportedFormats": "PNG, JPG, JPEG, GIF, WEBP ফরম্যাট সমর্থন করে, প্রতি ফাইল সর্বোচ্চ 5MB",
    "error": {
      "fileTooLarge": "ফাইল খুব বড়, অনুগ্রহ করে 5MB এর কম ছবি আপলোড করুন",
      "invalidFormat": "অনুগ্রহ করে বৈধ ছবির ফরম্যাট আপলোড করুন",
      "canvasContext": "ক্যানভাস কনটেক্সট তৈরি করা যাচ্ছে না",
      "noFilesUploaded": "কোন ছবি আপলোড করা হয়নি"
    }
  },
  "Privacy": {
    "title": "গোপনীয়তা নীতি",
    "description": "Color Replace ছবির রঙ বদল টুলের গোপনীয়তা নীতি",
    "keywords": "গোপনীয়তা নীতি, ডেটা সুরক্ষা, GDPR, ব্যবহারকারীর গোপনীয়তা, ছবি প্রক্রিয়াকরণ",
    "information_collection": {
      "title": "আমরা যে তথ্য সংগ্রহ করি",
      "description": "আমাদের রঙ বদল সেবা প্রদানের জন্য আমরা ন্যূনতম তথ্য সংগ্রহ করি:",
      "uploaded_images": "রঙ বদলের জন্য আপনার আপলোড করা ছবিগুলি (আপনার ব্রাউজারে স্থানীয়ভাবে প্রক্রিয়াকৃত)",
      "usage_data": "মৌলিক ব্যবহারের পরিসংখ্যান এবং বিশ্লেষণ ডেটা",
      "device_info": "সেবা উন্নতির জন্য ডিভাইস এবং ব্রাউজারের তথ্য"
    },
    "data_usage": {
      "title": "আমরা কীভাবে আপনার ডেটা ব্যবহার করি",
      "description": "আমরা সংগৃহীত তথ্য নিম্নলিখিত উদ্দেশ্যে ব্যবহার করি:",
      "provide_service": "আমাদের রঙ বদল সেবা প্রদান এবং রক্ষণাবেক্ষণের জন্য",
      "improve_service": "আমাদের টুলের কর্মক্ষমতা উন্নত এবং অপ্টিমাইজ করার জন্য",
      "analytics": "ব্যবহারের ধরন বুঝতে এবং ব্যবহারকারীর অভিজ্ঞতা উন্নত করার জন্য",
      "advertising": "Google AdSense এর মাধ্যমে প্রাসঙ্গিক বিজ্ঞাপন প্রদর্শনের জন্য"
    },
    "data_storage": {
      "title": "ডেটা সংরক্ষণ এবং নিরাপত্তা",
      "description": "আপনার গোপনীয়তা এবং ডেটা নিরাপত্তা আমাদের সর্বোচ্চ অগ্রাধিকার:",
      "temporary": "আপলোড করা ছবিগুলি আপনার ব্রাউজারে স্থানীয়ভাবে প্রক্রিয়াকৃত হয় এবং আমাদের সার্ভারে সংরক্ষিত হয় না"
    },
    "third_party": {
      "title": "তৃতীয় পক্ষের সেবা",
      "description": "আমরা নিম্নলিখিত তৃতীয় পক্ষের সেবা ব্যবহার করি:",
      "analytics": "ওয়েবসাইট বিশ্লেষণ এবং কর্মক্ষমতা পর্যবেক্ষণের জন্য",
      "advertising": "আমাদের ওয়েবসাইটে বিজ্ঞাপন প্রদর্শনের জন্য"
    },
    "cookies": {
      "title": "কুকিজ এবং ট্র্যাকিং",
      "description": "আমরা আপনার অভিজ্ঞতা উন্নত করতে এবং বিশ্লেষণ প্রদানের জন্য কুকিজ এবং অনুরূপ প্রযুক্তি ব্যবহার করি।",
      "control": "আপনি আপনার ব্রাউজার সেটিংস বা আমাদের সম্মতি ব্যবস্থাপনা প্ল্যাটফর্মের মাধ্যমে কুকি পছন্দগুলি নিয়ন্ত্রণ করতে পারেন।"
    },
    "user_rights": {
      "title": "আপনার অধিকার",
      "description": "GDPR এবং অন্যান্য গোপনীয়তা আইনের অধীনে, আপনার নিম্নলিখিত অধিকার রয়েছে:",
      "access": "আপনার ব্যক্তিগত ডেটা অ্যাক্সেস করার অধিকার",
      "correction": "ভুল ব্যক্তিগত ডেটা সংশোধন করার অধিকার",
      "deletion": "আপনার ব্যক্তিগত ডেটা মুছে ফেলার অনুরোধ করার অধিকার",
      "portability": "ডেটা পোর্টেবিলিটির অধিকার"
    },
    "contact": {
      "title": "যোগাযোগ করুন",
      "description": "এই গোপনীয়তা নীতি সম্পর্কে যদি আপনার কোন প্রশ্ন থাকে, অনুগ্রহ করে আমাদের ওয়েবসাইটের মাধ্যমে যোগাযোগ করুন।"
    },
    "updates": {
      "title": "নীতি আপডেট",
      "description": "আমরা সময়ে সময়ে এই গোপনীয়তা নীতি আপডেট করতে পারি। আমরা এই পৃষ্ঠায় নতুন গোপনীয়তা নীতি পোস্ট করে যেকোনো পরিবর্তন সম্পর্কে আপনাকে অবহিত করব।"
    },
    "last_updated": "সর্বশেষ আপডেট"
  },
  "Terms": {
    "title": "সেবার শর্তাবলী",
    "description": "Color Replace ছবির রঙ বদল টুলের সেবার শর্তাবলী",
    "keywords": "সেবার শর্তাবলী, ব্যবহারকারী চুক্তি, নিয়ম ও শর্তাবলী, সেবার শর্ত",
    "acceptance": {
      "title": "শর্তাবলী গ্রহণ",
      "description": "আমাদের Color Replace টুল অ্যাক্সেস এবং ব্যবহার করে, আপনি এই চুক্তির শর্তাবলী এবং বিধানগুলি মেনে চলতে সম্মত হন।"
    },
    "service_description": {
      "title": "সেবার বিবরণ",
      "description": "Color Replace একটি বিনামূল্যে অনলাইন টুল যা প্রদান করে:",
      "color_replacement": "ছবির রঙ বদল এবং সম্পাদনার ক্ষমতা",
      "image_processing": "সার্ভার আপলোড ছাড়াই স্থানীয় ছবি প্রক্রিয়াকরণ",
      "free_service": "সমস্ত মৌলিক রঙ বদল বৈশিষ্ট্যে বিনামূল্যে অ্যাক্সেস"
    },
    "user_responsibilities": {
      "title": "ব্যবহারকারীর দায়িত্ব",
      "description": "আমাদের সেবার ব্যবহারকারী হিসেবে, আপনি সম্মত হন:",
      "legal_content": "শুধুমাত্র সেই ছবি আপলোড এবং প্রক্রিয়া করতে যা ব্যবহার করার আইনি অধিকার আপনার আছে",
      "copyright": "কপিরাইট এবং বুদ্ধিবৃত্তিক সম্পত্তির অধিকার সম্মান করতে",
      "appropriate_use": "শুধুমাত্র আইনি উদ্দেশ্যে সেবা ব্যবহার করতে",
      "no_harmful_content": "ক্ষতিকর, আপত্তিজনক বা অনুপযুক্ত কন্টেন্ট আপলোড না করতে"
    },
    "prohibited_uses": {
      "title": "নিষিদ্ধ ব্যবহার",
      "description": "আপনি আমাদের সেবা নিম্নলিখিত কাজে ব্যবহার করতে পারবেন না:",
      "illegal_content": "অবৈধ বা ক্ষতিকর কন্টেন্ট প্রক্রিয়াকরণ",
      "copyright_violation": "কপিরাইট বা বুদ্ধিবৃত্তিক সম্পত্তির অধিকার লঙ্ঘন",
      "malicious_use": "যেকোনো দূষিত বা ক্ষতিকর কার্যকলাপ",
      "system_abuse": "আমাদের সিস্টেমের অপব্যবহার বা অতিরিক্ত চাপ দেওয়ার চেষ্টা"
    },
    "intellectual_property": {
      "title": "বুদ্ধিবৃত্তিক সম্পত্তি",
      "description": "Color Replace টুল এবং এর মূল কন্টেন্ট, বৈশিষ্ট্য এবং কার্যকারিতা আমাদের মালিকানাধীন এবং আন্তর্জাতিক কপিরাইট, ট্রেডমার্ক এবং অন্যান্য বুদ্ধিবৃত্তিক সম্পত্তি আইন দ্বারা সুরক্ষিত।",
      "user_content": "আমাদের টুল ব্যবহার করে আপনি যে ছবিগুলি আপলোড এবং প্রক্রিয়া করেন তার সমস্ত অধিকার আপনার থাকে।"
    },
    "disclaimers": {
      "title": "দায়মুক্তি",
      "description": "আমাদের সেবা 'যেমন আছে' ভিত্তিতে প্রদান করা হয়। আমরা কোন ওয়ারেন্টি, প্রকাশিত বা নিহিত, প্রদান করি না এবং এতদ্বারা নিম্নলিখিত সহ অন্যান্য সমস্ত ওয়ারেন্টি অস্বীকার করি:",
      "as_is": "সেবাটি কোনো ধরনের ওয়ারেন্টি ছাড়াই প্রদান করা হয়",
      "availability": "আমরা নিরবচ্ছিন্ন বা ত্রুটিমুক্ত সেবার গ্যারান্টি দিই না",
      "accuracy": "আমরা ফলাফলের নির্ভুলতা বা সম্পূর্ণতার ওয়ারেন্টি দিই না"
    },
    "limitation_liability": {
      "title": "দায়বদ্ধতার সীমাবদ্ধতা",
      "description": "কোনো অবস্থাতেই Color Replace কোনো পরোক্ষ, আনুষঙ্গিক, বিশেষ, পরিণতিমূলক বা শাস্তিমূলক ক্ষতির জন্য দায়ী থাকবে না, যার মধ্যে সীমাবদ্ধতা ছাড়াই, লাভ, ডেটা, ব্যবহার, সুনাম বা অন্যান্য অদৃশ্য ক্ষতি অন্তর্ভুক্ত।"
    },
    "termination": {
      "title": "সমাপ্তি",
      "description": "আমরা যেকোনো কারণে, পূর্ব নোটিশ বা দায়বদ্ধতা ছাড়াই আপনার অ্যাক্সেস অবিলম্বে বন্ধ বা স্থগিত করতে পারি, যার মধ্যে সীমাবদ্ধতা ছাড়াই আপনি শর্তাবলী লঙ্ঘন করলে।"
    },
    "changes": {
      "title": "শর্তাবলীর পরিবর্তন",
      "description": "আমরা আমাদের একমাত্র বিবেচনার ভিত্তিতে যেকোনো সময় এই শর্তাবলী পরিবর্তন বা প্রতিস্থাপন করার অধিকার সংরক্ষণ করি। যদি কোনো সংশোধনী গুরুত্বপূর্ণ হয়, আমরা নতুন শর্তাবলী কার্যকর হওয়ার আগে কমপক্ষে ৩০ দিনের নোটিশ দেওয়ার চেষ্টা করব।"
    },
    "governing_law": {
      "title": "প্রযোজ্য আইন",
      "description": "এই শর্তাবলী আমরা যে এখতিয়ারে কাজ করি সেই এখতিয়ারের আইন দ্বারা ব্যাখ্যা ও পরিচালিত হবে, আইনের দ্বন্দ্বের বিধান বিবেচনা না করে।"
    },
    "contact": {
      "title": "যোগাযোগের তথ্য",
      "description": "এই সেবার শর্তাবলী সম্পর্কে যদি আপনার কোন প্রশ্ন থাকে, অনুগ্রহ করে আমাদের ওয়েবসাইটের মাধ্যমে যোগাযোগ করুন।"
    },
    "last_updated": "সর্বশেষ আপডেট"
  },
  "Footer": {
    "rights_reserved": "সমস্ত অধিকার সংরক্ষিত।",
    "privacy_policy": "গোপনীয়তা নীতি",
    "terms_of_service": "সেবার শর্তাবলী"
  }
}