{
  "HomePage": {
    "title": "Image Color Replacement Tool",
    "originalImages": "Original Images",
    "processedImages": "Processed Images",
    "previewButton": "Preview",
    "downloadButton": "Download",
    "description": "Browser-based tool for fast image color replacement. Swap multiple colors, batch edit files, and keep quality with private on-device processing.",
    "keywords": "image color replacement, color swap tool, batch image editing, color changer, design tool"
  },
  "Header": {
    "title": "Color Replace",
    "subtitle": "Professional Online Image Color Replacement Tool",
    "home": "Home",
    "settings": "Settings",
    "about": "About"
  },
  "ColorReplaceSettings": {
    "title": "Color Replacement Settings",
    "addColorPair": "Add Color Pair",
    "colorPairTitle": "Color Pair #{id}",
    "removeColorPair": "Remove this color pair",
    "sourceColor": "Source Color",
    "targetColor": "Target Color",
    "toleranceLabel": "Color Match Tolerance: {value}%",
    "emptyState": "No color replacement rules. Click \"Add Color Pair\" to start",
    "toleranceTitle": "Color Match Tolerance",
    "toleranceLow": "Exact",
    "toleranceHigh": "Similar",
    "replace": "Replace",
    "download": "Download",
    "clearFiles": "Clear Images"
  },
  "ColorPicker": {
    "transparent": "transparent",
    "useTransparent": "Use transparent",
    "useColor": "Use color"
  },
  "EyeDropper": {
    "tooltip": "Use color picker"
  },
  "ToolDescription": {
    "title": "Free Online Image Color Replacement Tool",
    "mainDescription": "Transform your images instantly with our professional color replacement tool. Perfect for designers, marketers, and content creators who need to change image colors quickly and efficiently. Whether you're creating product variants, adjusting brand colors, or experimenting with design options, our tool provides precise color manipulation while preserving image quality - all directly in your browser, with no upload required.",
    "features": {
      "title": "Professional Features for Image Color Editing",
      "feature1": {
        "title": "Smart Color Replacement Technology",
        "description": "Replace any color in your images with pixel-perfect accuracy. Our advanced color matching algorithm ensures smooth transitions and professional-looking results, perfect for product photos and design assets."
      },
      "feature2": {
        "title": "Multi-Color Replacement",
        "description": "Save time by replacing multiple colors simultaneously. Ideal for brand color updates, theme changes, and creating product variations. Add multiple color pairs to transform entire color schemes at once."
      },
      "feature3": {
        "title": "Efficient Batch Processing",
        "description": "Process multiple images simultaneously with our powerful batch processing feature. Perfect for e-commerce product photos, marketing materials, and large design projects. Save hours of manual editing time."
      },
      "feature4": {
        "title": "Professional Color Selection Tools",
        "description": "Use our precise eyedropper tool to pick exact colors from your images. Compatible with hex codes and RGB values, making it easy to match your brand colors perfectly."
      },
      "feature5": {
        "title": "Advanced Color Matching Controls",
        "description": "Fine-tune your color replacements with our intelligent similarity controls. Perfect for handling gradients, shadows, and complex color variations while maintaining natural-looking results."
      },
      "feature6": {
        "title": "Secure Local Processing",
        "description": "Experience fast, secure image processing right in your browser. No file upload needed - your images never leave your device, ensuring complete privacy and instant results."
      }
    },
    "privacyTitle": "100% Private & Secure",
    "privacyDescription": "Your privacy and data security are our top priority. Unlike other online tools, our image processor works entirely in your browser - your images are never uploaded to any server. Work confidently knowing your sensitive design assets stay private and secure on your device."
  },
  "UsageExamples": {
    "title": "Usage Examples",
    "description": "Here are some examples of how to use the color replacement tool:",
    "before": "Before",
    "after": "After",
    "settingsTitle": "Color Settings",
    "tolerance": "Tolerance",
    "loadExample": "Load Example",
    "example1": {
      "title": "Multiple Color Pair settings",
      "description": "Replace multiple colors simultaneously by adding multiple color pairs.",
      "beforeAlt": "Empty state illustration with red color scheme",
      "afterAlt": "Empty state illustration with blue color scheme"
    },
    "example2": {
      "title": "Batch Images Processing",
      "description": "Process multiple images at once for efficient batch processing.",
      "beforeAlt": "a set of blue icons",
      "afterAlt": "a set of red icons"
    },
    "example3": {
      "title": "replace color by transparent",
      "description": "support replace color by transparent.",
      "beforeAlt": "avartar image with yellow background",
      "afterAlt": "avartar image with transparent background"
    }
  },
  "Metadata": {
    "title": "Color Replace - Free Online Image Color Replacement Tool",
    "titleTemplate": "%s | Color Replace - Image Color Editor",
    "description": "Free online tool for precise image color replacement. Replace multiple colors simultaneously, batch process images, and maintain image quality. No upload required - process locally in browser.",
    "keywords": "color replace, image color editor, color replacement tool, batch image processing, image color changer, color swap tool, image editing, design tool",
    "locale": "en_US",
    "ogTitle": "Color Replace - Free Online Image Color Replacement Tool",
    "ogDescription": "Transform your images with our powerful color replacement tool. Replace multiple colors, batch process images, and maintain quality. No upload needed - all processing happens in your browser.",
    "ogImageAlt": "Color Replace Tool Interface",
    "twitterTitle": "Color Replace - Free Online Image Color Replacement Tool",
    "twitterDescription": "Transform your images with our powerful color replacement tool. Replace multiple colors, batch process images, and maintain quality."
  },
  "ImageProcessor": {
    "dropToUpload": "Drop to upload images",
    "dragAndDrop": "Drag and drop images here, or click to upload",
    "supportedFormats": "Supports PNG, JPG, JPEG, GIF, WEBP formats, max 5MB per file",
    "error": {
      "fileTooLarge": "File too large, please upload images under 5MB",
      "invalidFormat": "Please upload valid image format files",
      "canvasContext": "Cannot create canvas context",
      "noFilesUploaded": "Please upload images to process"
    }
  },
  "Privacy": {
    "title": "Privacy Policy",
    "description": "Privacy policy for Color Replace image color replacement tool",
    "keywords": "privacy policy, data protection, GDPR, user privacy, image processing",
    "information_collection": {
      "title": "Information We Collect",
      "description": "We collect minimal information to provide our color replacement service:",
      "uploaded_images": "Images you upload for color replacement (processed locally in your browser)",
      "usage_data": "Basic usage statistics and analytics data",
      "device_info": "Device and browser information for service optimization"
    },
    "data_usage": {
      "title": "How We Use Your Data",
      "description": "We use collected information for the following purposes:",
      "provide_service": "To provide and maintain our color replacement service",
      "improve_service": "To improve and optimize our tool's performance",
      "analytics": "To understand usage patterns and improve user experience",
      "advertising": "To display relevant advertisements through Google AdSense"
    },
    "data_storage": {
      "title": "Data Storage and Security",
      "description": "Your privacy and data security are our top priorities:",
      "temporary": "Uploaded images are processed locally in your browser and are not stored on our servers"
    },
    "third_party": {
      "title": "Third-Party Services",
      "description": "We use the following third-party services:",
      "analytics": "For website analytics and performance monitoring",
      "advertising": "For displaying advertisements on our website"
    },
    "cookies": {
      "title": "Cookies and Tracking",
      "description": "We use cookies and similar technologies to enhance your experience and provide analytics.",
      "control": "You can control cookie preferences through your browser settings or our consent management platform."
    },
    "user_rights": {
      "title": "Your Rights",
      "description": "Under GDPR and other privacy laws, you have the following rights:",
      "access": "Right to access your personal data",
      "correction": "Right to correct inaccurate personal data",
      "deletion": "Right to request deletion of your personal data",
      "portability": "Right to data portability"
    },
    "contact": {
      "title": "Contact Us",
      "description": "If you have any questions about this Privacy Policy, please contact us through our website."
    },
    "updates": {
      "title": "Policy Updates",
      "description": "We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page."
    },
    "last_updated": "Last updated"
  },
  "Terms": {
    "title": "Terms of Service",
    "description": "Terms of service for Color Replace image color replacement tool",
    "keywords": "terms of service, user agreement, terms and conditions, service terms",
    "acceptance": {
      "title": "Acceptance of Terms",
      "description": "By accessing and using our Color Replace tool, you accept and agree to be bound by the terms and provision of this agreement."
    },
    "service_description": {
      "title": "Service Description",
      "description": "Color Replace is a free online tool that provides:",
      "color_replacement": "Image color replacement and editing capabilities",
      "image_processing": "Local image processing without server uploads",
      "free_service": "Free access to all basic color replacement features"
    },
    "user_responsibilities": {
      "title": "User Responsibilities",
      "description": "As a user of our service, you agree to:",
      "legal_content": "Only upload and process images you have the legal right to use",
      "copyright": "Respect copyright and intellectual property rights",
      "appropriate_use": "Use the service for lawful purposes only",
      "no_harmful_content": "Not upload harmful, offensive, or inappropriate content"
    },
    "prohibited_uses": {
      "title": "Prohibited Uses",
      "description": "You may not use our service for:",
      "illegal_content": "Processing illegal or harmful content",
      "copyright_violation": "Violating copyright or intellectual property rights",
      "malicious_use": "Any malicious or harmful activities",
      "system_abuse": "Attempting to abuse or overload our systems"
    },
    "intellectual_property": {
      "title": "Intellectual Property",
      "description": "The Color Replace tool and its original content, features, and functionality are owned by us and are protected by international copyright, trademark, and other intellectual property laws.",
      "user_content": "You retain all rights to images you upload and process using our tool."
    },
    "disclaimers": {
      "title": "Disclaimers",
      "description": "Our service is provided on an 'as is' basis. We make no warranties, expressed or implied, and hereby disclaim all other warranties including:",
      "as_is": "The service is provided without warranty of any kind",
      "availability": "We do not guarantee uninterrupted or error-free service",
      "accuracy": "We do not warrant the accuracy or completeness of results"
    },
    "limitation_liability": {
      "title": "Limitation of Liability",
      "description": "In no event shall Color Replace be liable for any indirect, incidental, special, consequential, or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses."
    },
    "termination": {
      "title": "Termination",
      "description": "We may terminate or suspend your access immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms."
    },
    "changes": {
      "title": "Changes to Terms",
      "description": "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will try to provide at least 30 days notice prior to any new terms taking effect."
    },
    "governing_law": {
      "title": "Governing Law",
      "description": "These Terms shall be interpreted and governed by the laws of the jurisdiction in which we operate, without regard to its conflict of law provisions."
    },
    "contact": {
      "title": "Contact Information",
      "description": "If you have any questions about these Terms of Service, please contact us through our website."
    },
    "last_updated": "Last updated"
  },
  "Footer": {
    "rights_reserved": "All rights reserved.",
    "privacy_policy": "Privacy Policy",
    "terms_of_service": "Terms of Service"
  }
}
