{
  "HomePage": {
    "title": "चित्र रंग परिवर्तिति - अपलॉड रंग संपादक",
    "originalImages": "अधिकारी चित्र",
    "processedImages": "परिवर्तित चित्र",
    "previewButton": "पूर्वावलोकन",
    "downloadButton": "डाउनलोड",
    "description": "पेशेवर ऑनलाइन चित्र रंग परिवर्तन टूल। एक साथ कई रंगों को बदलें, बैच में छवियों को प्रोसेस करें और छवि की गुणवत्ता बनाए रखें। ब्राउज़र में स्थानीय प्रोसेसिंग - कोई अपलोड नहीं। डिज़ाइनर्स, ई-कॉमर्स विक्रेताओं और मार्केटिंग पेशेवरों के लिए आदर्श।",
    "keywords": "छवि रंग बदलें,ऑनलाइन फोटो एडिटर,रंग परिवर्तन टूल,बैच इमेज प्रोसेसिंग,फ्री फोटो एडिटर,फोटोशॉप ऑनलाइन,बैकग्राउंड रिमूवर,ग्राफिक डिजाइन,फोटो एडिटिंग,डिजाइन टूल"
  },
  "Header": {
    "title": "रंग परिवर्तन सेटिंग्स",
    "subtitle": "प्रोफेशनल ऑनलाइन चित्र रंग परिवर्तन टूल",
    "home": "होम",
    "settings": "सेटिंग्स",
    "about": "अद्यावधिक"
  },
  "ColorReplaceSettings": {
    "title": "रंग परिवर्तन सेटिंग्स",
    "addColorPair": "रंग पार जोड़ें",
    "colorPairTitle": "रंग पार #{id}",
    "removeColorPair": "यह रंग पार को हटाएं",
    "sourceColor": "स्रोत रंग",
    "targetColor": "टार्गेट रंग",
    "toleranceLabel": "रंग मेल एक्सपेक्टेड: {value}%",
    "emptyState": "कोई रंग परिवर्तन नियम नहीं है। \"रंग पार जोड़ें\" बटन पर क्लिक करके शुरू करें",
    "toleranceTitle": "रंग मेल एक्सपेक्टेड",
    "toleranceLow": "एक्सपेक्टेड",
    "toleranceHigh": "समान",
    "replace": "अद्यावधिक",
    "download": "डाउनलोड",
    "clearFiles": "चित्र हटाएं"
  },
  "ColorPicker": {
    "transparent": "बलक",
    "useTransparent": "बलक बनायें",
    "useColor": "रंग बनायें"
  },
  "EyeDropper": {
    "tooltip": "रंग बटन पर क्लिक करें"
  },
  "ToolDescription": {
    "title": "चित्र रंग परिवर्तिति - अपलॉड रंग संपादक",
    "mainDescription": "अपलॉड करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।",
    "features": {
      "title": "अद्यावधिक विकल्प",
      "feature1": {
        "title": "अद्यावधिक विकल्प",
        "description": "रंग परिवर्तन करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      },
      "feature2": {
        "title": "मल्टी-रंग परिवर्तन",
        "description": "एक्सपेक्टेड रंग परिवर्तन करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      },
      "feature3": {
        "title": "अद्यावधिक विकल्प",
        "description": "एक्सपेक्टेड रंग परिवर्तन करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      },
      "feature4": {
        "title": "प्रोफेसियल रंग चुनी टूल",
        "description": "अपलॉड करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      },
      "feature5": {
        "title": "अद्यावधिक विकल्प",
        "description": "एक्सपेक्टेड रंग परिवर्तन करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      },
      "feature6": {
        "title": "सुरक्षित लोकल प्रोसेसिंग",
        "description": "एक्सपेक्टेड रंग परिवर्तन करते हैं अपलॉड रंग संपादक से रंग परिवर्तिति करते हैं। यह आपके लिए अद्यावधिक तरीके वाला रंग परिवर्तन टूल है।"
      }
    },
    "privacyTitle": "100% निजी और सुरक्षित",
    "privacyDescription": "आपकी गोपनीयता और डेटा सुरक्षा हमारी सर्वोच्च प्राथमिकता है। अन्य ऑनलाइन टूल्स के विपरीत, हमारा छवि प्रोसेसर पूरी तरह से आपके ब्राउज़र में काम करता है - आपकी छवियां कभी भी किसी सर्वर पर अपलोड नहीं होती हैं। अपनी संवेदनशील डिज़ाइन संपत्तियों को निजी और सुरक्षित रखते हुए आत्मविश्वास के साथ काम करें।"
  },
  "UsageExamples": {
    "title": "उपयोग के उदाहरण",
    "description": "यहाँ रंग बदलने वाले टूल के उपयोग के कुछ उदाहरण दिए गए हैं:",
    "before": "पहले",
    "after": "बाद में",
    "settingsTitle": "रंग सेटिंग्स",
    "tolerance": "सहनशीलता",
    "loadExample": "उदाहरण लोड करें",
    "example1": {
      "title": "बहु-रंग जोड़ी सेटिंग्स",
      "description": "एक साथ कई रंगों को बदलने के लिए कई रंग जोड़ियाँ जोड़ें।",
      "beforeAlt": "लाल रंग योजना के साथ खाली स्थिति चित्रण",
      "afterAlt": "नीले रंग योजना के साथ खाली स्थिति चित्रण"
    },
    "example2": {
      "title": "बैच छवियों की प्रोसेसिंग",
      "description": "कुशल बैच प्रोसेसिंग के लिए एक साथ कई छवियों को संसाधित करें।",
      "beforeAlt": "नीले आइकन का एक सेट",
      "afterAlt": "लाल आइकन का एक सेट"
    },
    "example3": {
      "title": "रंग को पारदर्शी में बदलें",
      "description": "पारदर्शी में रंग बदलने का समर्थन करें।",
      "beforeAlt": "पीले पृष्ठभूमि वाली अवतार छवि",
      "afterAlt": "पारदर्शी पृष्ठभूमि वाली अवतार छवि"
    }
  },
  "Metadata": {
    "title": "रंग बदलें - मुफ्त ऑनलाइन छवि रंग बदलने का टूल",
    "titleTemplate": "%s | रंग बदलें - छवि रंग संपादक",
    "description": "छवि रंग बदलने के लिए मुफ्त ऑनलाइन टूल। एक साथ कई रंग बदलें, छवियों को बैच में संसाधित करें, और छवि की गुणवत्ता बनाए रखें। अपलोड की आवश्यकता नहीं - ब्राउज़र में स्थानीय रूप से संसाधित करें।",
    "keywords": "रंग बदलें, छवि रंग संपादक, रंग बदलने का टूल, बैच छवि संसाधन, छवि रंग बदलने वाला, रंग स्वैप टूल, छवि संपादन, डिजाइन टूल",
    "locale": "hi_IN",
    "ogTitle": "रंग बदलें - मुफ्त ऑनलाइन छवि रंग बदलने का टूल",
    "ogDescription": "अपनी छवियों को हमारे शक्तिशाली रंग बदलने वाले टूल से बदलें। कई रंग बदलें, छवियों को बैच में संसाधित करें, और गुणवत्ता बनाए रखें। अपलोड की आवश्यकता नहीं - सभी संसाधन आपके ब्राउज़र में होता है।",
    "ogImageAlt": "रंग बदलें टूल इंटरफ़ेस",
    "twitterTitle": "रंग बदलें - मुफ्त ऑनलाइन छवि रंग बदलने का टूल",
    "twitterDescription": "अपनी छवियों को हमारे शक्तिशाली रंग बदलने वाले टूल से बदलें। कई रंग बदलें, छवियों को बैच में संसाधित करें, और गुणवत्ता बनाए रखें।"
  },
  "ImageProcessor": {
    "dropToUpload": "चित्र अपलॉड करें",
    "dragAndDrop": "चित्र अपलॉड करें",
    "supportedFormats": "PNG, JPG, JPEG, GIF, WEBP प्रारूप समर्थित हैं, प्रति फ़ाइल अधिकतम 5MB",
    "error": {
      "fileTooLarge": "फ़ाइल बड़ा है, 5MB से अधिक नहीं अपलॉड करें",
      "invalidFormat": "कृपया वैध चित्र फ़ोर्मेट फ़ाइल अपलॉड करें",
      "canvasContext": "कैनवस कूंटक्ट बनाने में असमर्थ",
      "noFilesUploaded": "कोई चित्र अपलोड नहीं किया गया"
    }
  },
  "Privacy": {
    "title": "गोपनीयता नीति",
    "description": "रंग बदलें छवि रंग परिवर्तन टूल के लिए गोपनीयता नीति",
    "keywords": "गोपनीयता नीति, डेटा सुरक्षा, GDPR, उपयोगकर्ता गोपनीयता, छवि प्रसंस्करण",
    "information_collection": {
      "title": "हमारे द्वारा एकत्रित जानकारी",
      "description": "हम अपनी रंग परिवर्तन सेवा प्रदान करने के लिए न्यूनतम जानकारी एकत्र करते हैं:",
      "uploaded_images": "रंग परिवर्तन के लिए आपके द्वारा अपलोड की गई छवियां (आपके ब्राउज़र में स्थानीय रूप से संसाधित)",
      "usage_data": "मूलभूत उपयोग आंकड़े और विश्लेषण डेटा",
      "device_info": "सेवा अनुकूलन के लिए डिवाइस और ब्राउज़र जानकारी"
    },
    "data_usage": {
      "title": "हम आपके डेटा का उपयोग कैसे करते हैं",
      "description": "हम एकत्रित जानकारी का उपयोग निम्नलिखित उद्देश्यों के लिए करते हैं:",
      "provide_service": "हमारी रंग परिवर्तन सेवा प्रदान करने और बनाए रखने के लिए",
      "improve_service": "हमारे टूल के प्रदर्शन में सुधार करने और अनुकूलित करने के लिए",
      "analytics": "उपयोग पैटर्न को समझने और उपयोगकर्ता अनुभव में सुधार करने के लिए",
      "advertising": "Google AdSense के माध्यम से प्रासंगिक विज्ञापन प्रदर्शित करने के लिए"
    },
    "data_storage": {
      "title": "डेटा संग्रहण और सुरक्षा",
      "description": "आपकी गोपनीयता और डेटा सुरक्षा हमारी सर्वोच्च प्राथमिकताएं हैं:",
      "temporary": "अपलोड की गई छवियां आपके ब्राउज़र में स्थानीय रूप से संसाधित होती हैं और हमारे सर्वर पर संग्रहीत नहीं होती हैं"
    },
    "third_party": {
      "title": "तृतीय-पक्ष सेवाएं",
      "description": "हम निम्नलिखित तृतीय-पक्ष सेवाओं का उपयोग करते हैं:",
      "analytics": "वेबसाइट विश्लेषण और प्रदर्शन निगरानी के लिए",
      "advertising": "हमारी वेबसाइट पर विज्ञापन प्रदर्शित करने के लिए"
    },
    "cookies": {
      "title": "कुकीज और ट्रैकिंग",
      "description": "हम आपके अनुभव को बढ़ाने और विश्लेषण प्रदान करने के लिए कुकीज और समान तकनीकों का उपयोग करते हैं।",
      "control": "आप अपने ब्राउज़र सेटिंग्स या हमारे सहमति प्रबंधन मंच के माध्यम से कुकी प्राथमिकताओं को नियंत्रित कर सकते हैं।"
    },
    "user_rights": {
      "title": "आपके अधिकार",
      "description": "GDPR और अन्य गोपनीयता कानूनों के तहत, आपके पास निम्नलिखित अधिकार हैं:",
      "access": "आपके व्यक्तिगत डेटा तक पहुंच का अधिकार",
      "correction": "अशुद्ध व्यक्तिगत डेटा को सुधारने का अधिकार",
      "deletion": "आपके व्यक्तिगत डेटा के हटाने का अनुरोध करने का अधिकार",
      "portability": "डेटा पोर्टेबिलिटी का अधिकार"
    },
    "contact": {
      "title": "हमसे संपर्क करें",
      "description": "यदि आपके पास इस गोपनीयता नीति के बारे में कोई प्रश्न है, तो कृपया हमारी वेबसाइट के माध्यम से हमसे संपर्क करें।"
    },
    "updates": {
      "title": "नीति अपडेट",
      "description": "हम समय-समय पर इस गोपनीयता नीति को अपडेट कर सकते हैं। हम इस पृष्ठ पर नई गोपनीयता नीति पोस्ट करके किसी भी परिवर्तन की आपको सूचित करेंगे।"
    },
    "last_updated": "अंतिम अपडेट"
  },
  "Terms": {
    "title": "सेवा की शर्तें",
    "description": "रंग बदलें छवि रंग परिवर्तन टूल के लिए सेवा की शर्तें",
    "keywords": "सेवा की शर्तें, उपयोगकर्ता समझौता, नियम और शर्तें, सेवा शर्तें",
    "acceptance": {
      "title": "शर्तों की स्वीकृति",
      "description": "हमारे रंग बदलें टूल तक पहुंचकर और उसका उपयोग करके, आप इस समझौते की शर्तों और प्रावधानों से बंधे रहने के लिए स्वीकार करते हैं और सहमत होते हैं।"
    },
    "service_description": {
      "title": "सेवा विवरण",
      "description": "रंग बदलें एक मुफ्त ऑनलाइन टूल है जो प्रदान करता है:",
      "color_replacement": "छवि रंग परिवर्तन और संपादन क्षमताएं",
      "image_processing": "सर्वर अपलोड के बिना स्थानीय छवि प्रसंस्करण",
      "free_service": "सभी बुनियादी रंग परिवर्तन सुविधाओं तक मुफ्त पहुंच"
    },
    "user_responsibilities": {
      "title": "उपयोगकर्ता की जिम्मेदारियां",
      "description": "हमारी सेवा के उपयोगकर्ता के रूप में, आप सहमत होते हैं कि:",
      "legal_content": "केवल उन छवियों को अपलोड और संसाधित करें जिनका उपयोग करने का आपको कानूनी अधिकार है",
      "copyright": "कॉपीराइट और बौद्धिक संपदा अधिकारों का सम्मान करें",
      "appropriate_use": "सेवा का उपयोग केवल कानूनी उद्देश्यों के लिए करें",
      "no_harmful_content": "हानिकारक, आपत्तिजनक, या अनुचित सामग्री अपलोड न करें"
    },
    "prohibited_uses": {
      "title": "निषिद्ध उपयोग",
      "description": "आप हमारी सेवा का उपयोग निम्नलिखित के लिए नहीं कर सकते:",
      "illegal_content": "अवैध या हानिकारक सामग्री का प्रसंस्करण",
      "copyright_violation": "कॉपीराइट या बौद्धिक संपदा अधिकारों का उल्लंघन",
      "malicious_use": "कोई भी दुर्भावनापूर्ण या हानिकारक गतिविधियां",
      "system_abuse": "हमारे सिस्टम का दुरुपयोग या अधिभार करने का प्रयास"
    },
    "intellectual_property": {
      "title": "बौद्धिक संपदा",
      "description": "रंग बदलें टूल और इसकी मूल सामग्री, सुविधाएं, और कार्यक्षमता हमारे स्वामित्व में हैं और अंतर्राष्ट्रीय कॉपीराइट, ट्रेडमार्क, और अन्य बौद्धिक संपदा कानूनों द्वारा संरक्षित हैं।",
      "user_content": "आप हमारे टूल का उपयोग करके अपलोड और संसाधित की गई छवियों के सभी अधिकार बनाए रखते हैं।"
    },
    "disclaimers": {
      "title": "अस्वीकरण",
      "description": "हमारी सेवा 'जैसा है' के आधार पर प्रदान की जाती है। हम कोई वारंटी, व्यक्त या निहित, नहीं देते हैं और यहां सभी अन्य वारंटी जिनमें शामिल हैं, को अस्वीकार करते हैं:",
      "as_is": "सेवा किसी भी प्रकार की वारंटी के बिना प्रदान की जाती है",
      "availability": "हम बाधित या त्रुटि-मुक्त सेवा की गारंटी नहीं देते हैं",
      "accuracy": "हम परिणामों की सटीकता या पूर्णता की वारंटी नहीं देते हैं"
    },
    "limitation_liability": {
      "title": "देयता की सीमा",
      "description": "किसी भी परिस्थिति में रंग बदलें किसी भी अप्रत्यक्ष, आकस्मिक, विशेष, परिणामी, या दंडात्मक क्षति के लिए उत्तरदायी नहीं होगा, जिसमें लाभ, डेटा, उपयोग, गुडविल, या अन्य अमूर्त हानियों के नुकसान की सीमा शामिल है।"
    },
    "termination": {
      "title": "समाप्ति",
      "description": "हम किसी भी कारण से, बिना पूर्व सूचना या देयता के, तुरंत आपकी पहुंच को समाप्त या निलंबित कर सकते हैं, जिसमें यदि आप शर्तों का उल्लंघन करते हैं तो भी शामिल है।"
    },
    "changes": {
      "title": "शर्तों में परिवर्तन",
      "description": "हम अपने विवेकाधिकार पर, किसी भी समय इन शर्तों को संशोधित या बदलने का अधिकार सुरक्षित रखते हैं। यदि कोई संशोधन महत्वपूर्ण है, तो हम किसी भी नई शर्तों के प्रभावी होने से पहले कम से कम 30 दिन की सूचना देने का प्रयास करेंगे।"
    },
    "governing_law": {
      "title": "शासी कानून",
      "description": "ये शर्तें उन कानूनों के अनुसार व्याख्या की जाएंगी और उनके द्वारा शासित होंगी जिस क्षेत्राधिकार में हम काम करते हैं, इसके कानूनी प्रावधानों के टकराव को ध्यान में रखे बिना।"
    },
    "contact": {
      "title": "संपर्क जानकारी",
      "description": "यदि आपके पास इन सेवा की शर्तों के बारे में कोई प्रश्न है, तो कृपया हमारी वेबसाइट के माध्यम से हमसे संपर्क करें।"
    },
    "last_updated": "अंतिम अपडेट"
  },
  "Footer": {
    "rights_reserved": "सर्वाधिकार सुरक्षित।",
    "privacy_policy": "गोपनीयता नीति",
    "terms_of_service": "सेवा की शर्तें"
  }
}