{
    "HomePage": {
      "title": "Alat Penggantian Warna Gambar - Editor Warna Online Gratis",
      "originalImages": "Gambar Asli",
      "processedImages": "Gambar Diproses",
      "previewButton": "Pratinjau",
      "downloadButton": "Unduh",
      "description": "Alat profesional online untuk mengganti warna gambar. Ganti beberapa warna sekaligus, proses gambar secara batch, dan jaga kualitas gambar. Pemrosesan lokal di browser tanpa perlu mengunggah. Ideal untuk desainer, penjual e-commerce, dan profesional pemasaran.",
      "keywords": "edit warna gambar,editor foto online,ganti warna,pengolahan gambar,editor gambar gratis,photoshop online,hapus background,desain grafis,edit foto,alat desain"
    },
    "Header": {
      "title": "Ganti Warna",
      "subtitle": "Alat Profesional Penggantian Warna Gambar Online",
      "home": "Beranda",
      "settings": "Pengaturan",
      "about": "Tentang"
    },
    "ColorReplaceSettings": {
      "title": "Pengaturan Penggantian Warna",
      "addColorPair": "Tambah Pasangan Warna",
      "colorPairTitle": "Pasangan Warna #{id}",
      "removeColorPair": "Hapus pasangan warna ini",
      "sourceColor": "Warna Sumber",
      "targetColor": "Warna Tujuan",
      "toleranceLabel": "Toleransi Kecocokan Warna: {value}%",
      "emptyState": "Tidak ada aturan penggantian warna. Klik \"Tambah Pasangan Warna\" untuk memulai",
      "toleranceTitle": "Toleransi Kecocokan Warna",
      "toleranceLow": "Persis",
      "toleranceHigh": "Mirip",
      "replace": "Ganti",
      "download": "Unduh",
      "clearFiles": "Hapus gambar"
    },
    "ColorPicker": {
      "transparent": "transparan",
      "useTransparent": "Gunakan transparan",
      "useColor": "Gunakan warna"
    },
    "EyeDropper": {
      "tooltip": "Gunakan pemilih warna"
    },
    "ToolDescription": {
      "title": "Alat Penggantian Warna Gambar Online Gratis",
      "mainDescription": "Ubah gambar Anda secara instan dengan alat penggantian warna profesional kami. Cocok untuk desainer, pemasar, dan pembuat konten yang memerlukan mengubah warna gambar dengan cepat dan efisien. Baik Anda membuat varian produk, menyesuaikan warna merek, atau bereksperimen dengan opsi desain, alat kami menyediakan manipulasi warna yang presisi sambil menjaga kualitas gambar - semuanya langsung di browser Anda, tanpa perlu mengunggah.",
      "features": {
        "title": "Fitur Profesional untuk Pengeditan Warna Gambar",
        "feature1": {
          "title": "Teknologi Penggantian Warna Cerdas",
          "description": "Gantilah warna apa pun di gambar Anda dengan akurasi yang tepat. Algoritma pencocokan warna canggih kami memastikan transisi yang halus dan hasil yang profesional, cocok untuk foto produk dan aset desain."
        },
        "feature2": {
          "title": "Penggantian Warna Multi",
          "description": "Hemat waktu dengan menggantikan beberapa warna secara bersamaan. Ideal untuk pembaruan warna merek, perubahan tema, dan membuat varian produk. Tambahkan beberapa pasangan warna untuk mengubah seluruh skema warna sekaligus."
        },
        "feature3": {
          "title": "Pengolahan Batch yang Efisien",
          "description": "Proses beberapa gambar secara bersamaan dengan fitur pengolahan batch yang kuat kami. Cocok untuk foto produk e-commerce, materi pemasaran, dan proyek desain besar. Hemat waktu pengeditan manual berjam-jam."
        },
        "feature4": {
          "title": "Alat Pemilihan Warna Profesional",
          "description": "Gunakan alat eyedropper yang presisi kami untuk memilih warna yang tepat dari gambar Anda. Kompatibel dengan kode heksa dan nilai RGB, membuatnya mudah untuk mencocokkan warna merek Anda dengan sempurna."
        },
        "feature5": {
          "title": "Kendali Pencocokan Warna Cerdas",
          "description": "Tune penggantian warna Anda dengan kendali kesamaan yang cerdas kami. Cocok untuk menangani gradien, bayangan, dan variasi warna yang kompleks sambil menjaga hasil yang terlihat alami."
        },
        "feature6": {
          "title": "Pengolahan Lokal yang Aman",
          "description": "Rasakan pengolahan gambar yang cepat dan aman langsung di browser Anda. Tidak perlu mengunggah file - gambar Anda tidak pernah meninggalkan perangkat Anda, memastikan privasi dan hasil yang instan."
        }
      },
      "privacyTitle": "100% Pribadi & Aman",
      "privacyDescription": "Privasi dan keamanan data Anda adalah prioritas utama kami. Tidak seperti alat online lainnya, pengolah gambar kami bekerja sepenuhnya di browser Anda - gambar Anda tidak pernah diunggah ke server mana pun. Bekerja dengan percaya diri mengetahui aset desain yang sensitif tetap pribadi dan aman di perangkat Anda."
    },
    "UsageExamples": {
      "title": "Contoh Penggunaan",
      "description": "Berikut beberapa contoh penggunaan alat penggantian warna:",
      "before": "Sebelum",
      "after": "Sesudah",
      "settingsTitle": "Pengaturan Warna",
      "tolerance": "Toleransi",
      "loadExample": "Muat Contoh",
      "example1": {
        "title": "Pengaturan Pasangan Warna Multi",
        "description": "Gantilah beberapa warna secara bersamaan dengan menambahkan beberapa pasangan warna.",
        "beforeAlt": "Ilustrasi keadaan kosong dengan skema warna merah",
        "afterAlt": "Ilustrasi keadaan kosong dengan skema warna biru"
      },
      "example2": {
        "title": "Pengolahan Gambar Batch",
        "description": "Proses beberapa gambar sekaligus untuk pengolahan batch yang efisien.",
        "beforeAlt": "sebuah set ikon biru",
        "afterAlt": "sebuah set ikon merah"
      },
      "example3": {
        "title": "ganti warna dengan transparan",
        "description": "mendukung menggantikan warna dengan transparan.",
        "beforeAlt": "gambar avatar dengan latar belakang kuning",
        "afterAlt": "gambar avatar dengan latar belakang transparan"
      }
    },
    "Metadata": {
      "title": "Ganti Warna - Alat Penggantian Warna Gambar Online Gratis",
      "titleTemplate": "%s | Ganti Warna - Editor Warna Gambar",
      "description": "Alat online gratis untuk penggantian warna gambar yang presisi. Gantilah beberapa warna secara bersamaan, proses gambar batch, dan pertahankan kualitas gambar. Tidak perlu mengunggah - proses langsung di browser.",
      "keywords": "ganti warna, editor warna gambar, alat penggantian warna, pengolahan gambar batch, penggantian warna gambar, alat pertukaran warna, pengeditan gambar, alat desain",
      "locale": "id_ID",
      "ogTitle": "Ganti Warna - Alat Penggantian Warna Gambar Online Gratis",
      "ogDescription": "Ubah gambar Anda dengan alat penggantian warna yang kuat kami. Gantilah beberapa warna, proses gambar batch, dan pertahankan kualitas. Tidak perlu mengunggah - semua proses terjadi di browser Anda.",
      "ogImageAlt": "Antarmuka Alat Ganti Warna",
      "twitterTitle": "Ganti Warna - Alat Penggantian Warna Gambar Online Gratis",
      "twitterDescription": "Ubah gambar Anda dengan alat penggantian warna yang kuat kami. Gantilah beberapa warna, proses gambar batch, dan pertahankan kualitas."
    },
    "ImageProcessor": {
      "dropToUpload": "Tarik dan unggah gambar",
      "dragAndDrop": "Tarik dan unggah gambar di sini, atau klik untuk mengunggah",
      "supportedFormats": "Mendukung format PNG, JPG, JPEG, GIF, WEBP, maksimum 5MB per file",
      "error": {
        "fileTooLarge": "File terlalu besar, silakan unggah gambar di bawah 5MB",
        "invalidFormat": "Silakan unggah file format gambar yang valid",
        "canvasContext": "Tidak dapat membuat konteks canvas",
        "noFilesUploaded": "Tidak ada gambar yang diunggah"
      }
    },
    "Privacy": {
      "title": "Kebijakan Privasi",
      "description": "Kebijakan privasi untuk alat penggantian warna gambar Color Replace",
      "keywords": "kebijakan privasi, perlindungan data, GDPR, privasi pengguna, pengolahan gambar",
      "information_collection": {
        "title": "Informasi yang Kami Kumpulkan",
        "description": "Kami mengumpulkan informasi minimal untuk menyediakan layanan penggantian warna:",
        "uploaded_images": "Gambar yang Anda unggah untuk penggantian warna (diproses secara lokal di browser Anda)",
        "usage_data": "Statistik penggunaan dasar dan data analitik",
        "device_info": "Informasi perangkat dan browser untuk optimasi layanan"
      },
      "data_usage": {
        "title": "Bagaimana Kami Menggunakan Data Anda",
        "description": "Kami menggunakan informasi yang dikumpulkan untuk tujuan berikut:",
        "provide_service": "Untuk menyediakan dan memelihara layanan penggantian warna kami",
        "improve_service": "Untuk meningkatkan dan mengoptimalkan kinerja alat kami",
        "analytics": "Untuk memahami pola penggunaan dan meningkatkan pengalaman pengguna",
        "advertising": "Untuk menampilkan iklan yang relevan melalui Google AdSense"
      },
      "data_storage": {
        "title": "Penyimpanan dan Keamanan Data",
        "description": "Privasi dan keamanan data Anda adalah prioritas utama kami:",
        "temporary": "Gambar yang diunggah diproses secara lokal di browser Anda dan tidak disimpan di server kami"
      },
      "third_party": {
        "title": "Layanan Pihak Ketiga",
        "description": "Kami menggunakan layanan pihak ketiga berikut:",
        "analytics": "Untuk analitik website dan pemantauan kinerja",
        "advertising": "Untuk menampilkan iklan di website kami"
      },
      "cookies": {
        "title": "Cookie dan Pelacakan",
        "description": "Kami menggunakan cookie dan teknologi serupa untuk meningkatkan pengalaman Anda dan menyediakan analitik.",
        "control": "Anda dapat mengontrol preferensi cookie melalui pengaturan browser atau platform manajemen persetujuan kami."
      },
      "user_rights": {
        "title": "Hak Anda",
        "description": "Di bawah GDPR dan undang-undang privasi lainnya, Anda memiliki hak berikut:",
        "access": "Hak untuk mengakses data pribadi Anda",
        "correction": "Hak untuk memperbaiki data pribadi yang tidak akurat",
        "deletion": "Hak untuk meminta penghapusan data pribadi Anda",
        "portability": "Hak atas portabilitas data"
      },
      "contact": {
        "title": "Hubungi Kami",
        "description": "Jika Anda memiliki pertanyaan tentang Kebijakan Privasi ini, silakan hubungi kami melalui website kami."
      },
      "updates": {
        "title": "Pembaruan Kebijakan",
        "description": "Kami mungkin memperbarui Kebijakan Privasi ini dari waktu ke waktu. Kami akan memberi tahu Anda tentang perubahan dengan memposting Kebijakan Privasi baru di halaman ini."
      },
      "last_updated": "Terakhir diperbarui"
    },
    "Terms": {
      "title": "Syarat Layanan",
      "description": "Syarat layanan untuk alat penggantian warna gambar Color Replace",
      "keywords": "syarat layanan, perjanjian pengguna, syarat dan ketentuan, ketentuan layanan",
      "acceptance": {
        "title": "Penerimaan Syarat",
        "description": "Dengan mengakses dan menggunakan alat Color Replace kami, Anda menerima dan setuju untuk terikat oleh syarat dan ketentuan perjanjian ini."
      },
      "service_description": {
        "title": "Deskripsi Layanan",
        "description": "Color Replace adalah alat online gratis yang menyediakan:",
        "color_replacement": "Kemampuan penggantian dan pengeditan warna gambar",
        "image_processing": "Pengolahan gambar lokal tanpa pengunggahan ke server",
        "free_service": "Akses gratis ke semua fitur penggantian warna dasar"
      },
      "user_responsibilities": {
        "title": "Tanggung Jawab Pengguna",
        "description": "Sebagai pengguna layanan kami, Anda setuju untuk:",
        "legal_content": "Hanya mengunggah dan memproses gambar yang memiliki hak legal untuk digunakan",
        "copyright": "Menghormati hak cipta dan hak kekayaan intelektual",
        "appropriate_use": "Menggunakan layanan hanya untuk tujuan yang sah",
        "no_harmful_content": "Tidak mengunggah konten yang berbahaya, ofensif, atau tidak pantas"
      },
      "prohibited_uses": {
        "title": "Penggunaan yang Dilarang",
        "description": "Anda tidak dapat menggunakan layanan kami untuk:",
        "illegal_content": "Memproses konten ilegal atau berbahaya",
        "copyright_violation": "Melanggar hak cipta atau hak kekayaan intelektual",
        "malicious_use": "Aktivitas berbahaya atau merusak apa pun",
        "system_abuse": "Mencoba menyalahgunakan atau membebani sistem kami"
      },
      "intellectual_property": {
        "title": "Kekayaan Intelektual",
        "description": "Alat Color Replace dan konten, fitur, dan fungsionalitas aslinya dimiliki oleh kami dan dilindungi oleh undang-undang hak cipta, merek dagang, dan kekayaan intelektual internasional lainnya.",
        "user_content": "Anda mempertahankan semua hak atas gambar yang Anda unggah dan proses menggunakan alat kami."
      },
      "disclaimers": {
        "title": "Penafian",
        "description": "Layanan kami disediakan 'sebagaimana adanya'. Kami tidak memberikan jaminan, baik tersurat maupun tersirat, dan dengan ini menolak semua jaminan lainnya termasuk:",
        "as_is": "Layanan disediakan tanpa jaminan apa pun",
        "availability": "Kami tidak menjamin layanan yang tidak terganggu atau bebas kesalahan",
        "accuracy": "Kami tidak menjamin keakuratan atau kelengkapan hasil"
      },
      "limitation_liability": {
        "title": "Pembatasan Tanggung Jawab",
        "description": "Dalam keadaan apa pun Color Replace tidak akan bertanggung jawab atas kerusakan tidak langsung, insidental, khusus, konsekuensial, atau hukuman, termasuk tanpa batasan, kerugian laba, data, penggunaan, goodwill, atau kerugian tidak berwujud lainnya."
      },
      "termination": {
        "title": "Penghentian",
        "description": "Kami mungkin menghentikan atau menangguhkan akses Anda segera, tanpa pemberitahuan sebelumnya atau tanggung jawab, untuk alasan apa pun, termasuk tanpa batasan jika Anda melanggar Syarat."
      },
      "changes": {
        "title": "Perubahan Syarat",
        "description": "Kami berhak, atas kebijakan tunggal kami, untuk memodifikasi atau mengganti Syarat ini kapan saja. Jika revisi bersifat material, kami akan mencoba memberikan setidaknya 30 hari pemberitahuan sebelum syarat baru berlaku."
      },
      "governing_law": {
        "title": "Hukum yang Berlaku",
        "description": "Syarat ini akan ditafsirkan dan diatur oleh hukum yurisdiksi di mana kami beroperasi, tanpa memperhatikan ketentuan konflik hukumnya."
      },
      "contact": {
        "title": "Informasi Kontak",
        "description": "Jika Anda memiliki pertanyaan tentang Syarat Layanan ini, silakan hubungi kami melalui website kami."
      },
      "last_updated": "Terakhir diperbarui"
    },
    "Footer": {
      "rights_reserved": "Semua hak dilindungi.",
      "privacy_policy": "Kebijakan Privasi",
      "terms_of_service": "Syarat Layanan"
    }
  }