{
    "HomePage": {
      "title": "Инструмент Замены Цветов Изображений - Бесплатный Онлайн Редактор Цветов",
      "originalImages": "Оригинальные Изображения",
      "processedImages": "Обработанные Изображения",
      "previewButton": "Предварительный просмотр",
      "downloadButton": "Скачать",
      "description": "Профессиональный онлайн инструмент для замены цветов в изображениях. Заменяйте несколько цветов одновременно, обрабатывайте изображения пакетами и сохраняйте качество. Локальная обработка в браузере без загрузки на сервер. Идеально подходит для дизайнеров, продавцов электронной коммерции и маркетологов.",
      "keywords": "изменить цвет изображения,онлайн редактор фото,замена цветов,пакетная обработка,бесплатный редактор изображений,фотошоп онлайн,удаление фона,графический дизайн,редактирование фото,инструменты дизайна"
    },
    "Header": {
      "title": "Замена Цвета",
      "subtitle": "Профессиональный Онлайн Инструмент Замены Цветов Изображений",
      "home": "Главная",
      "settings": "Настройки",
      "about": "О программе"
    },
    "ColorReplaceSettings": {
      "title": "Настройки Замены Цветов",
      "addColorPair": "Добавить Пару Цветов",
      "colorPairTitle": "Пара Цветов #{id}",
      "removeColorPair": "Удалить эту пару цветов",
      "sourceColor": "Исходный Цвет",
      "targetColor": "Целевой Цвет",
      "toleranceLabel": "Допуск Совпадения Цветов: {value}%",
      "emptyState": "Нет правил замены цветов. Нажмите \"Добавить Пару Цветов\" для начала",
      "toleranceTitle": "Допуск Совпадения Цветов",
      "toleranceLow": "Точно",
      "toleranceHigh": "Похоже",
      "replace": "Заменить",
      "download": "Скачать",
      "clearFiles": "Очистить изображения"
    },
    "ColorPicker": {
      "transparent": "прозрачный",
      "useTransparent": "Использовать прозрачный цвет",
      "useColor": "Использовать цвет"
    },
    "EyeDropper": {
      "tooltip": "Использовать пиксель"
    },
    "ToolDescription": {
      "title": "Бесплатный Онлайн Инструмент Замены Цветов Изображений",
      "mainDescription": "Мгновенно преобразуйте свои изображения с помощью нашего профессионального инструмента замены цветов. Идеально подходит для дизайнеров, маркетологов и создателей контента, которым необходимо быстро и эффективно изменять цвета изображений. Независимо от того, создаете ли вы варианты продуктов, корректируете фирменные цвета или экспериментируете с вариантами дизайна, наш инструмент обеспечивает точную цветовую манипуляцию с сохранением качества изображения - все прямо в вашем браузере, без необходимости загрузки.",
      "features": {
        "title": "Профессиональные Функции Редактирования Цветов Изображений",
        "feature1": {
          "title": "Интеллектуальная Технология Замены Цветов",
          "description": "Заменяйте любой цвет в ваших изображениях с точностью до пикселя. Наш передовой алгоритм сопоставления цветов обеспечивает плавные переходы и профессиональный результат, идеально подходящий для фотографий продуктов и дизайн-активов."
        },
        "feature2": {
          "title": "Замена Нескольких Цветов",
          "description": "Экономьте время, заменяя несколько цветов одновременно. Идеально подходит для обновления цветов бренда, изменения темы и создания вариаций продуктов. Добавляйте несколько пар цветов, чтобы преобразить весь цветовой схему за один раз."
        },
        "feature3": {
          "title": "Эффективная Пакетная Обработка",
          "description": "Обрабатывайте несколько изображений одновременно с помощью нашей мощной функции пакетной обработки. Идеально подходит для фотографий электронной коммерции, маркетинговых материалов и крупных дизайнерских проектов. Сэкономьте часы ручного редактирования."
        },
        "feature4": {
          "title": "Профессиональные Инструменты Выбора Цветов",
          "description": "Используйте наш точный инструмент пипетки для выбора точных цветов из ваших изображений. Совместим с hex-кодами и значениями RGB, что облегчает точное сопоставление цветов вашего бренда."
        },
        "feature5": {
          "title": "Расширенные Элементы Управления Сопоставлением Цветов",
          "description": "Тонко настраивайте замену цветов с помощью наших интеллектуальных элементов управления подобием. Идеально подходит для работы с градиентами, тенями и сложными цветовыми вариациями с сохранением естественного вида."
        },
        "feature6": {
          "title": "Безопасная Локальная Обработка",
          "description": "Испытайте быструю, безопасную обработку изображений прямо в вашем браузере. Загрузка файлов не требуется - ваши изображения никогда не покидают ваше устройство, обеспечивая полную конфиденциальность и мгновенные результаты."
        }
      },
      "privacyTitle": "100% Конфиденциально и Безопасно",
      "privacyDescription": "Ваша конфиденциальность и безопасность данных - наш главный приоритет. В отличие от других онлайн-инструментов, наш обработчик изображений работает полностью в вашем браузере - ваши изображения никогда не загружаются на какой-либо сервер. Работайте уверенно, зная, что ваши чувствительные дизайн-активы остаются приватными и защищенными на вашем устройстве."
    },
    "UsageExamples": {
      "title": "Примеры Использования",
      "description": "Вот несколько примеров использования инструмента замены цветов:",
      "before": "До",
      "after": "После",
      "settingsTitle": "Настройки Цветов",
      "tolerance": "Допуск",
      "loadExample": "Загрузить Пример",
      "example1": {
        "title": "Настройки Нескольких Пар Цветов",
        "description": "Замена нескольких цветов одновременно путем добавления нескольких пар цветов.",
        "beforeAlt": "Иллюстрация пустого состояния с красной цветовой схемой",
        "afterAlt": "Иллюстрация пустого состояния с синей цветовой схемой"
      },
      "example2": {
        "title": "Пакетная Обработка Изображений",
        "description": "Обработка нескольких изображений одновременно для эффективной пакетной обработки.",
        "beforeAlt": "набор синих иконок",
        "afterAlt": "набор красных иконок"
      },
      "example3": {
        "title": "Замена Цвета на Прозрачный",
        "description": "Поддержка замены цвета на прозрачный.",
        "beforeAlt": "изображение аватара с желтым фоном",
        "afterAlt": "изображение аватара с прозрачным фоном"
      }
    },
    "Metadata": {
      "title": "Замена Цвета - Бесплатный Онлайн Инструмент Замены Цветов Изображений",
      "titleTemplate": "%s | Замена Цвета - Редактор Цветов Изображений",
      "description": "Бесплатный онлайн-инструмент для точной замены цветов в изображениях. Заменяйте несколько цветов одновременно, обрабатывайте изображения пакетами и сохраняйте качество. Без загрузки - обработка локально в браузере.",
      "keywords": "замена цвета, редактор цветов изображений, инструмент замены цветов, пакетная обработка изображений, изменение цвета изображения, инструмент обмена цветов, редактирование изображений, инструмент дизайна",
      "locale": "ru_RU",
      "ogTitle": "Замена Цвета - Бесплатный Онлайн Инструмент Замены Цветов Изображений",
      "ogDescription": "Преобразите свои изображения с помощью нашего мощного инструмента замены цветов. Заменяйте несколько цветов, обрабатывайте изображения пакетами и сохраняйте качество. Без загрузки - вся обработка происходит в вашем браузере.",
      "ogImageAlt": "Интерфейс Инструмента Замены Цвета",
      "twitterTitle": "Замена Цвета - Бесплатный Онлайн Инструмент Замены Цветов Изображений",
      "twitterDescription": "Преобразите свои изображения с помощью нашего мощного инструмента замены цветов. Заменяйте несколько цветов, обрабатывайте изображения пакетами и сохраняйте качество."
    },
    "ImageProcessor": {
      "dropToUpload": "Перетащите для загрузки изображений",
      "dragAndDrop": "Перетащите изображения сюда или нажмите для загрузки",
      "supportedFormats": "Поддерживаются форматы PNG, JPG, JPEG, GIF, WEBP, максимум 5 МБ на файл",
      "error": {
        "fileTooLarge": "Файл слишком большой, пожалуйста, загружайте изображения размером до 5 МБ",
        "invalidFormat": "Пожалуйста, загружайте файлы изображений в допустимых форматах",
        "canvasContext": "Не удалось создать контекст холста",
        "noFilesUploaded": "Изображения не загружены"
      }
    },
  "Privacy": {
    "title": "Политика Конфиденциальности",
    "description": "Политика конфиденциальности для инструмента замены цветов изображений Замена Цвета",
    "keywords": "политика конфиденциальности, защита данных, GDPR, конфиденциальность пользователя, обработка изображений",
    "information_collection": {
      "title": "Информация, которую мы собираем",
      "description": "Мы собираем минимальную информацию для предоставления нашей услуги замены цветов:",
      "uploaded_images": "Изображения, которые вы загружаете для замены цветов (обрабатываются локально в вашем браузере)",
      "usage_data": "Базовая статистика использования и аналитические данные",
      "device_info": "Информация об устройстве и браузере для оптимизации сервиса"
    },
    "data_usage": {
      "title": "Как мы используем ваши данные",
      "description": "Мы используем собранную информацию для следующих целей:",
      "provide_service": "Для предоставления и поддержки нашей услуги замены цветов",
      "improve_service": "Для улучшения и оптимизации производительности нашего инструмента",
      "analytics": "Для понимания паттернов использования и улучшения пользовательского опыта",
      "advertising": "Для отображения релевантной рекламы через Google AdSense"
    },
    "data_storage": {
      "title": "Хранение и безопасность данных",
      "description": "Ваша конфиденциальность и безопасность данных - наш главный приоритет:",
      "temporary": "Загруженные изображения обрабатываются локально в вашем браузере и не хранятся на наших серверах"
    },
    "third_party": {
      "title": "Сторонние сервисы",
      "description": "Мы используем следующие сторонние сервисы:",
      "analytics": "Для анализа сайта и мониторинга производительности",
      "advertising": "Для отображения рекламы на нашем сайте"
    },
    "cookies": {
      "title": "Файлы cookie и отслеживание",
      "description": "Мы используем файлы cookie и подобные технологии для улучшения вашего опыта и предоставления аналитики.",
      "control": "Вы можете управлять предпочтениями cookie через настройки браузера или нашу платформу управления согласием."
    },
    "user_rights": {
      "title": "Ваши права",
      "description": "Согласно GDPR и другим законам о конфиденциальности, у вас есть следующие права:",
      "access": "Право на доступ к вашим персональным данным",
      "correction": "Право на исправление неточных персональных данных",
      "deletion": "Право на удаление ваших персональных данных",
      "portability": "Право на переносимость данных"
    },
    "contact": {
      "title": "Свяжитесь с нами",
      "description": "Если у вас есть вопросы об этой Политике Конфиденциальности, пожалуйста, свяжитесь с нами через наш сайт."
    },
    "updates": {
      "title": "Обновления политики",
      "description": "Мы можем время от времени обновлять эту Политику Конфиденциальности. Мы уведомим вас о любых изменениях, разместив новую Политику Конфиденциальности на этой странице."
    },
    "last_updated": "Последнее обновление"
  },
  "Terms": {
    "title": "Условия Использования",
    "description": "Условия использования для инструмента замены цветов изображений Замена Цвета",
    "keywords": "условия использования, пользовательское соглашение, условия и положения, условия сервиса",
    "acceptance": {
      "title": "Принятие условий",
      "description": "Получая доступ и используя наш инструмент Замена Цвета, вы принимаете и соглашаетесь соблюдать условия и положения этого соглашения."
    },
    "service_description": {
      "title": "Описание сервиса",
      "description": "Замена Цвета - это бесплатный онлайн инструмент, который предоставляет:",
      "color_replacement": "Возможности замены и редактирования цветов изображений",
      "image_processing": "Локальная обработка изображений без загрузки на сервер",
      "free_service": "Бесплатный доступ ко всем основным функциям замены цветов"
    },
    "user_responsibilities": {
      "title": "Ответственности пользователя",
      "description": "Как пользователь нашего сервиса, вы соглашаетесь:",
      "legal_content": "Загружать и обрабатывать только изображения, на которые у вас есть законное право использования",
      "copyright": "Соблюдать авторские права и интеллектуальную собственность",
      "appropriate_use": "Использовать сервис только для законных целей",
      "no_harmful_content": "Не загружать вредный, оскорбительный или неуместный контент"
    },
    "prohibited_uses": {
      "title": "Запрещенные использования",
      "description": "Вы не можете использовать наш сервис для:",
      "illegal_content": "Обработки незаконного или вредного контента",
      "copyright_violation": "Нарушения авторских прав или интеллектуальной собственности",
      "malicious_use": "Любых вредоносных или злонамеренных действий",
      "system_abuse": "Попыток злоупотребить или перегрузить наши системы"
    },
    "intellectual_property": {
      "title": "Интеллектуальная собственность",
      "description": "Инструмент Замена Цвета и его оригинальное содержимое, функции и функциональность принадлежат нам и защищены международными законами об авторском праве, товарных знаках и других законах об интеллектуальной собственности.",
      "user_content": "Вы сохраняете все права на изображения, которые вы загружаете и обрабатываете с помощью нашего инструмента."
    },
    "disclaimers": {
      "title": "Отказ от ответственности",
      "description": "Наш сервис предоставляется 'как есть'. Мы не даем никаких гарантий, явных или подразумеваемых, и настоящим отказываемся от всех других гарантий, включая:",
      "as_is": "Сервис предоставляется без каких-либо гарантий",
      "availability": "Мы не гарантируем бесперебойную или безошибочную работу сервиса",
      "accuracy": "Мы не гарантируем точность или полноту результатов"
    },
    "limitation_liability": {
      "title": "Ограничение ответственности",
      "description": "Ни при каких обстоятельствах Замена Цвета не будет нести ответственности за любые косвенные, случайные, специальные, последующие или штрафные убытки, включая, без ограничения, потерю прибыли, данных, использования, деловой репутации или другие нематериальные убытки."
    },
    "termination": {
      "title": "Прекращение",
      "description": "Мы можем немедленно прекратить или приостановить ваш доступ без предварительного уведомления или ответственности по любой причине, включая, без ограничения, если вы нарушаете Условия."
    },
    "changes": {
      "title": "Изменения в условиях",
      "description": "Мы оставляем за собой право, по своему усмотрению, изменять или заменять эти Условия в любое время. Если изменения существенны, мы постараемся предоставить уведомление не менее чем за 30 дней до вступления в силу новых условий."
    },
    "governing_law": {
      "title": "Применимое право",
      "description": "Эти Условия будут толковаться и регулироваться законами юрисдикции, в которой мы работаем, без учета коллизионных норм."
    },
    "contact": {
      "title": "Контактная информация",
      "description": "Если у вас есть вопросы об этих Условиях Использования, пожалуйста, свяжитесь с нами через наш сайт."
    },
    "last_updated": "Последнее обновление"
  },
  "Footer": {
    "rights_reserved": "Все права защищены.",
    "privacy_policy": "Политика Конфиденциальности",
    "terms_of_service": "Условия Использования"
  }
}