{
  "HomePage": {
    "title": "เครื่องมือเปลี่ยนสีภาพ - ตัวแก้ไขสีออนไลน์ฟรี",
    "originalImages": "ภาพต้นฉบับ",
    "processedImages": "ภาพที่ประมวลผล",
    "previewButton": "ดูตัวอย่าง",
    "downloadButton": "ดาวน์โหลด",
    "description": "เครื่องมือออนไลน์ระดับมืออาชีพสำหรับการเปลี่ยนสีในภาพ เปลี่ยนสีหลายสีพร้อมกัน ประมวลผลภาพเป็นชุด และรักษาคุณภาพภาพ ประมวลผลในเบราว์เซอร์โดยไม่ต้องอัปโหลด เหมาะสำหรับนักออกแบบ ผู้ขายอีคอมเมิร์ซ และนักการตลาดมืออาชีพ",
    "keywords": "แก้ไขสีภาพ,แต่งรูปออนไลน์,เปลี่ยนสี,ประมวลผลภาพ,โปรแกรมแต่งรูปฟรี,โฟโต้ชอปออนไลน์,ลบพื้นหลัง,กราฟิกดีไซน์,แต่งภาพ,เครื่องมือออกแบบ"
  },
  "Header": {
    "title": "เปลี่ยนสี",
    "subtitle": "เครื่องมือเปลี่ยนสีภาพออนไลน์แบบมืออาชีพ",
    "home": "หน้าหลัก",
    "settings": "การตั้งค่า",
    "about": "เกี่ยวกับ"
  },
  "ColorReplaceSettings": {
    "title": "การตั้งค่าการเปลี่ยนสี",
    "addColorPair": "เพิ่มคู่สี",
    "colorPairTitle": "คู่สีที่ #{id}",
    "removeColorPair": "ลบคู่สีนี้",
    "sourceColor": "สีต้นทาง",
    "targetColor": "สีปลายทาง",
    "toleranceLabel": "ระดับความคล้ายสี: {value}%",
    "emptyState": "ยังไม่มีกฎการเปลี่ยนสี คลิก \"เพิ่มคู่สี\" เพื่อเริ่มต้น",
    "toleranceTitle": "ระดับความคล้ายสี",
    "toleranceLow": "แม่นยำ",
    "toleranceHigh": "คล้าย",
    "replace": "เปลี่ยน",
    "download": "ดาวน์โหลด",
    "clearFiles": "ล้างรูปภาพ"
  },
  "ColorPicker": {
    "transparent": "โปร่งใส",
    "useTransparent": "ใช้แบบโปร่งใส",
    "useColor": "ใช้สี"
  },
  "EyeDropper": {
    "tooltip": "ใช้เครื่องมือเลือกสี"
  },
  "ToolDescription": {
    "title": "เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "mainDescription": "เปลี่ยนภาพของคุณทันทีด้วยเครื่องมือเปลี่ยนสีมืออาชีพของเรา เหมาะสำหรับนักออกแบบ นักการตลาด และผู้สร้างเนื้อหาที่ต้องการเปลี่ยนสีภาพอย่างรวดเร็วและมีประสิทธิภาพ ไม่ว่าคุณจะสร้าผลิตภัณฑ์รุ่นต่างๆ ปรับสีแบรนด์ หรือทดลองตัวเลือกการออกแบบ เครื่องมือของเราให้การจัดการสีอย่างแม่นยำในขณะที่ยังคงคุณภาพภาพ - ทั้งหมดนี้ทำได้โดยตรงในเบราว์เซอร์ โดยไม่ต้องอัปโหลด",
    "features": {
      "title": "คุณสมบัติมืออาชีพสำหรับการแก้ไขสีภาพ",
      "feature1": {
        "title": "เทคโนโลยีการเปลี่ยนสีอัจฉริยะ",
        "description": "เปลี่ยนสีใดๆ ในภาพของคุณด้วยความแม่นยำระดับพิกเซล อัลกอริทึมการจับคู่สีขั้นสูงของเราช่วยให้มีการเปลี่ยนผ่านที่ราบรื่นและผลลัพธ์ที่ดูมืออาชีพ เหมาะสำหรับภาพผลิตภัณฑ์และสินทรัพย์การออกแบบกลุ่ม"
      },
      "feature2": {
        "title": "การเปลี่ยนสีหลายสี",
        "description": "ประหยัดเวลาโดยการเปลี่ยนสีหลายสีพร้อมกัน เหมาะสำหรับการอัปเดตสีแบรนด์ การเปลี่ยนธีม และการสร้าผลิตภัณฑ์รุ่นต่างๆ เพิ่มคู่สีหลายคู่เพื่อเปลี่ยนแปลงชุดสีทั้งหมดในคราวเดียว"
      },
      "feature3": {
        "title": "การประมวลผลแบบกลุ่มที่มีประสิทธิภาพ",
        "description": "ประมวลผลภาพหลายภาพพร้อมกันด้วยคุณสมบัติการประมวลผลแบบกลุ่มที่ทรงพลัง เหมาะสำหรับภาพผลิตภัณฑ์อีคอมเมิร์ซ วัสดุการตลาด และโครงการออกแบบขนาดใหญ่ ประหยัดเวลาการแก้ไขด้วยตนเองเป็นชั่วโมง"
      },
      "feature4": {
        "title": "เครื่องมือเลือกสีมืออาชีพ",
        "description": "ใช้เครื่องมือหยดสีที่แม่นยำของเราเพื่อเลือกสีที่แน่นอนจากภาพของคุณ รองรัสเฮ็กซ์และค่า RGB ช่วยให้จับคู่สีแบรนด์ได้อย่างง่ายดาย"
      },
      "feature5": {
        "title": "การควบคุมการจับคู่สีขั้นสูง",
        "description": "ปรับแต่งการเปลี่ยนสีของคุณด้วยการควบคุมความคล้ายอัจฉริยะของเรา เหมาะสำหรับการจัดการเกรเดียนต์ เงา และความแปรปรวนของสีที่ซับซ้อน ในขณะที่ยังคงผลลัพธ์ที่ดูธรรมชาติ"
      },
      "feature6": {
        "title": "การประมวลผลภาพที่ปลอดภัยในเครื่อง",
        "description": "สัมผัสประสบการณ์การประมวลผลภาพที่รวดเร็วและปลอดภัยในเบราว์เซอร์ของคุณ ไม่ต้องอัปโหลดไฟล์ - ภาพของคุณจะไม่ออกจากอุปกรณ์ของคุณ เพื่อความเป็นส่วนตัวอย่างสมบูรณ์และผลลัพธ์ทันที"
      }
    },
    "privacyTitle": "100% เป็นส่วนตัวและปลอดภัย",
    "privacyDescription": "ความเป็นส่วนตัวและความปลอดภัยของข้อมูลของคุณเป็นสิ่งสำคัญอันดับแรกของเรา ต่างจากเครื่องมือออนไลน์อื่นๆ ตัวประมวลผลภาพของเราทำงานทั้งหมดในเบราว์เซอร์ของคุณ - ภาพของคุณจะไม่ถูกอัปโหลดไปยังเซิร์ฟเวอร์ใดๆ ทำงานอย่างมั่นใจโดยรู้ว่าสินทรัพย์การออกแบบที่ละเอียดอ่อนของคุณจะคงอยู่เป็นส่วนตัวและปลอดภัยบนอุปกรณ์ของคุณ"
  },
  "UsageExamples": {
    "title": "ตัวอย่างการใช้งาน",
    "description": "นี่คือตัวอย่างวิธีการใช้เครื่องมือเปลี่ยนสี:",
    "before": "ก่อน",
    "after": "หลัง",
    "settingsTitle": "การตั้งค่าสี",
    "tolerance": "ระดับความคล้าย",
    "loadExample": "โหลดตัวอย่าง",
    "example1": {
      "title": "การตั้งค่าคู่สีหลายคู่",
      "description": "เปลี่ยนสีหลายสีในภาพเดียวกัน เช่น เปลี่ยนสีเสื้อผ้าและพื้นหลังให้เข้ากับแบรนด์ของคุณ",
      "beforeAlt": "ภาพสินค้าในชุดสีแดง",
      "afterAlt": "ภาพสินค้าในชุดสีน้ำเงิน"
    },
    "example2": {
      "title": "การประมวลผลภาพแบบกลุ่ม",
      "description": "เปลี่ยนสีสำหรับหลายภาพในคราวเดียว เหมาะสำหรับการสร้างชุดผลิตภัณฑ์หรือปรับปรุงแบรนด์ของคุณ",
      "beforeAlt": "ภาพสินค้าในชุดสีแดง",
      "afterAlt": "ภาพสินค้าในชุดสีน้ำเงิน"
    },
    "example3": {
      "title": "การจับคู่สีที่ซับซ้อน",
      "description": "ใช้การควบคุมระดับความคล้ายเพื่อจัดการกับสีเกรเดียนต์และเงาที่ซับซ้อน เพื่อให้ได้ผลลัพธ์ที่ดูเป็นธรรมชาติ",
      "beforeAlt": "ภาพทิวทัศน์ที่มีเกรเดียนต์สีแดง",
      "afterAlt": "ภาพทิวทัศน์ที่มีเกรเดียนต์สีเขียว"
    }
  },
  "Metadata": {
    "title": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "titleTemplate": "%s | เปลี่ยนสี - ตัวแก้ไขสีภาพ",
    "description": "เครื่องมือออนไลน์ฟรีสำหรับการเปลี่ยนสีภาพอย่างแม่นยำ เปลี่ยนสีหลายสีพร้อมกัน ประมวลผลภาพเป็นชุด และรักษาคุณภาพภาพ ไม่ต้องอัปโหลด - ประมวลผลบนเบราว์เซอร์",
    "keywords": [
      "เปลี่ยนสี",
      "แก้ไขสีภาพ", 
      "เครื่องมือเปลี่ยนสี",
      "ประมวลผลภาพเป็นชุด",
      "เปลี่ยนสีภาพ",
      "เครื่องมือสลับสี",
      "แก้ไขภาพ",
      "เครื่องมือออกแบบ"
    ],
    "locale": "th_TH",
    "ogTitle": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "ogDescription": "เปลี่ยนแปลงภาพของคุณด้วยเครื่องมือเปลี่ยนสีที่ทรงพลัง เปลี่ยนสีหลายสี ประมวลผลเป็นชุด และรักษาคุณภาพ ไม่ต้องอัปโหลด - การประมวลผลทั้งหมดเกิดขึ้นบนเบราว์เซอร์ของคุณ",
    "ogImageAlt": "อินเทอร์เฟซเครื่องมือเปลี่ยนสี",
    "twitterTitle": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "twitterDescription": "เปลี่ยนแปลงภาพของคุณด้วยเครื่องมือเปลี่ยนสีที่ทรงพลัง เปลี่ยนสีหลายสี ประมวลผลเป็นชุด และรักษาคุณภาพ"
  },
  "ImageProcessor": {
    "dropToUpload": "วางเพื่ออัปโหลดภาพ",
    "dragAndDrop": "ลากและวางภาพที่นี่ หรือคลิกเพื่ออัปโหลด",
    "supportedFormats": "รองรับไฟล์ PNG, JPG, JPEG, GIF, WEBP ขนาดสูงสุด 5MB ต่อไฟล์",
    "error": {
      "fileTooLarge": "ไฟล์มีขนาดใหญ่เกินไป กรุณาอัปโหลดภาพที่มีขนาดไม่เกิน 5MB",
      "invalidFormat": "กรุณาอัปโหลดไฟล์ภาพที่ถูกต้อง",
      "canvasContext": "ไม่สามารถสร้างบริบทแคนวาสได้",
      "noFilesUploaded": "ไม่มีรูปภาพที่อัปโหลด"
    }
  }
}