{
  "HomePage": {
    "title": "เครื่องมือเปลี่ยนสีภาพ - ตัวแก้ไขสีออนไลน์ฟรี",
    "originalImages": "ภาพต้นฉบับ",
    "processedImages": "ภาพที่ประมวลผล",
    "previewButton": "ดูตัวอย่าง",
    "downloadButton": "ดาวน์โหลด",
    "description": "เครื่องมือออนไลน์ระดับมืออาชีพสำหรับการเปลี่ยนสีในภาพ เปลี่ยนสีหลายสีพร้อมกัน ประมวลผลภาพเป็นชุด และรักษาคุณภาพภาพ ประมวลผลในเบราว์เซอร์โดยไม่ต้องอัปโหลด เหมาะสำหรับนักออกแบบ ผู้ขายอีคอมเมิร์ซ และนักการตลาดมืออาชีพ",
    "keywords": "แก้ไขสีภาพ,แต่งรูปออนไลน์,เปลี่ยนสี,ประมวลผลภาพ,โปรแกรมแต่งรูปฟรี,โฟโต้ชอปออนไลน์,ลบพื้นหลัง,กราฟิกดีไซน์,แต่งภาพ,เครื่องมือออกแบบ"
  },
  "Header": {
    "title": "เปลี่ยนสี",
    "subtitle": "เครื่องมือเปลี่ยนสีภาพออนไลน์แบบมืออาชีพ",
    "home": "หน้าหลัก",
    "settings": "การตั้งค่า",
    "about": "เกี่ยวกับ"
  },
  "ColorReplaceSettings": {
    "title": "การตั้งค่าการเปลี่ยนสี",
    "addColorPair": "เพิ่มคู่สี",
    "colorPairTitle": "คู่สีที่ #{id}",
    "removeColorPair": "ลบคู่สีนี้",
    "sourceColor": "สีต้นทาง",
    "targetColor": "สีปลายทาง",
    "toleranceLabel": "ระดับความคล้ายสี: {value}%",
    "emptyState": "ยังไม่มีกฎการเปลี่ยนสี คลิก \"เพิ่มคู่สี\" เพื่อเริ่มต้น",
    "toleranceTitle": "ระดับความคล้ายสี",
    "toleranceLow": "แม่นยำ",
    "toleranceHigh": "คล้าย",
    "replace": "เปลี่ยน",
    "download": "ดาวน์โหลด",
    "clearFiles": "ล้างรูปภาพ"
  },
  "ColorPicker": {
    "transparent": "โปร่งใส",
    "useTransparent": "ใช้แบบโปร่งใส",
    "useColor": "ใช้สี"
  },
  "EyeDropper": {
    "tooltip": "ใช้เครื่องมือเลือกสี"
  },
  "ToolDescription": {
    "title": "เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "mainDescription": "เปลี่ยนภาพของคุณทันทีด้วยเครื่องมือเปลี่ยนสีมืออาชีพของเรา เหมาะสำหรับนักออกแบบ นักการตลาด และผู้สร้างเนื้อหาที่ต้องการเปลี่ยนสีภาพอย่างรวดเร็วและมีประสิทธิภาพ ไม่ว่าคุณจะสร้าผลิตภัณฑ์รุ่นต่างๆ ปรับสีแบรนด์ หรือทดลองตัวเลือกการออกแบบ เครื่องมือของเราให้การจัดการสีอย่างแม่นยำในขณะที่ยังคงคุณภาพภาพ - ทั้งหมดนี้ทำได้โดยตรงในเบราว์เซอร์ โดยไม่ต้องอัปโหลด",
    "features": {
      "title": "คุณสมบัติมืออาชีพสำหรับการแก้ไขสีภาพ",
      "feature1": {
        "title": "เทคโนโลยีการเปลี่ยนสีอัจฉริยะ",
        "description": "เปลี่ยนสีใดๆ ในภาพของคุณด้วยความแม่นยำระดับพิกเซล อัลกอริทึมการจับคู่สีขั้นสูงของเราช่วยให้มีการเปลี่ยนผ่านที่ราบรื่นและผลลัพธ์ที่ดูมืออาชีพ เหมาะสำหรับภาพผลิตภัณฑ์และสินทรัพย์การออกแบบกลุ่ม"
      },
      "feature2": {
        "title": "การเปลี่ยนสีหลายสี",
        "description": "ประหยัดเวลาโดยการเปลี่ยนสีหลายสีพร้อมกัน เหมาะสำหรับการอัปเดตสีแบรนด์ การเปลี่ยนธีม และการสร้าผลิตภัณฑ์รุ่นต่างๆ เพิ่มคู่สีหลายคู่เพื่อเปลี่ยนแปลงชุดสีทั้งหมดในคราวเดียว"
      },
      "feature3": {
        "title": "การประมวลผลแบบกลุ่มที่มีประสิทธิภาพ",
        "description": "ประมวลผลภาพหลายภาพพร้อมกันด้วยคุณสมบัติการประมวลผลแบบกลุ่มที่ทรงพลัง เหมาะสำหรับภาพผลิตภัณฑ์อีคอมเมิร์ซ วัสดุการตลาด และโครงการออกแบบขนาดใหญ่ ประหยัดเวลาการแก้ไขด้วยตนเองเป็นชั่วโมง"
      },
      "feature4": {
        "title": "เครื่องมือเลือกสีมืออาชีพ",
        "description": "ใช้เครื่องมือหยดสีที่แม่นยำของเราเพื่อเลือกสีที่แน่นอนจากภาพของคุณ รองรัสเฮ็กซ์และค่า RGB ช่วยให้จับคู่สีแบรนด์ได้อย่างง่ายดาย"
      },
      "feature5": {
        "title": "การควบคุมการจับคู่สีขั้นสูง",
        "description": "ปรับแต่งการเปลี่ยนสีของคุณด้วยการควบคุมความคล้ายอัจฉริยะของเรา เหมาะสำหรับการจัดการเกรเดียนต์ เงา และความแปรปรวนของสีที่ซับซ้อน ในขณะที่ยังคงผลลัพธ์ที่ดูธรรมชาติ"
      },
      "feature6": {
        "title": "การประมวลผลภาพที่ปลอดภัยในเครื่อง",
        "description": "สัมผัสประสบการณ์การประมวลผลภาพที่รวดเร็วและปลอดภัยในเบราว์เซอร์ของคุณ ไม่ต้องอัปโหลดไฟล์ - ภาพของคุณจะไม่ออกจากอุปกรณ์ของคุณ เพื่อความเป็นส่วนตัวอย่างสมบูรณ์และผลลัพธ์ทันที"
      }
    },
    "privacyTitle": "100% เป็นส่วนตัวและปลอดภัย",
    "privacyDescription": "ความเป็นส่วนตัวและความปลอดภัยของข้อมูลของคุณเป็นสิ่งสำคัญอันดับแรกของเรา ต่างจากเครื่องมือออนไลน์อื่นๆ ตัวประมวลผลภาพของเราทำงานทั้งหมดในเบราว์เซอร์ของคุณ - ภาพของคุณจะไม่ถูกอัปโหลดไปยังเซิร์ฟเวอร์ใดๆ ทำงานอย่างมั่นใจโดยรู้ว่าสินทรัพย์การออกแบบที่ละเอียดอ่อนของคุณจะคงอยู่เป็นส่วนตัวและปลอดภัยบนอุปกรณ์ของคุณ"
  },
  "UsageExamples": {
    "title": "ตัวอย่างการใช้งาน",
    "description": "นี่คือตัวอย่างวิธีการใช้เครื่องมือเปลี่ยนสี:",
    "before": "ก่อน",
    "after": "หลัง",
    "settingsTitle": "การตั้งค่าสี",
    "tolerance": "ระดับความคล้าย",
    "loadExample": "โหลดตัวอย่าง",
    "example1": {
      "title": "การตั้งค่าคู่สีหลายคู่",
      "description": "เปลี่ยนสีหลายสีในภาพเดียวกัน เช่น เปลี่ยนสีเสื้อผ้าและพื้นหลังให้เข้ากับแบรนด์ของคุณ",
      "beforeAlt": "ภาพสินค้าในชุดสีแดง",
      "afterAlt": "ภาพสินค้าในชุดสีน้ำเงิน"
    },
    "example2": {
      "title": "การประมวลผลภาพแบบกลุ่ม",
      "description": "เปลี่ยนสีสำหรับหลายภาพในคราวเดียว เหมาะสำหรับการสร้างชุดผลิตภัณฑ์หรือปรับปรุงแบรนด์ของคุณ",
      "beforeAlt": "ภาพสินค้าในชุดสีแดง",
      "afterAlt": "ภาพสินค้าในชุดสีน้ำเงิน"
    },
    "example3": {
      "title": "การจับคู่สีที่ซับซ้อน",
      "description": "ใช้การควบคุมระดับความคล้ายเพื่อจัดการกับสีเกรเดียนต์และเงาที่ซับซ้อน เพื่อให้ได้ผลลัพธ์ที่ดูเป็นธรรมชาติ",
      "beforeAlt": "ภาพทิวทัศน์ที่มีเกรเดียนต์สีแดง",
      "afterAlt": "ภาพทิวทัศน์ที่มีเกรเดียนต์สีเขียว"
    }
  },
  "Metadata": {
    "title": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "titleTemplate": "%s | เปลี่ยนสี - ตัวแก้ไขสีภาพ",
    "description": "เครื่องมือออนไลน์ฟรีสำหรับการเปลี่ยนสีภาพอย่างแม่นยำ เปลี่ยนสีหลายสีพร้อมกัน ประมวลผลภาพเป็นชุด และรักษาคุณภาพภาพ ไม่ต้องอัปโหลด - ประมวลผลบนเบราว์เซอร์",
    "keywords": [
      "เปลี่ยนสี",
      "แก้ไขสีภาพ", 
      "เครื่องมือเปลี่ยนสี",
      "ประมวลผลภาพเป็นชุด",
      "เปลี่ยนสีภาพ",
      "เครื่องมือสลับสี",
      "แก้ไขภาพ",
      "เครื่องมือออกแบบ"
    ],
    "locale": "th_TH",
    "ogTitle": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "ogDescription": "เปลี่ยนแปลงภาพของคุณด้วยเครื่องมือเปลี่ยนสีที่ทรงพลัง เปลี่ยนสีหลายสี ประมวลผลเป็นชุด และรักษาคุณภาพ ไม่ต้องอัปโหลด - การประมวลผลทั้งหมดเกิดขึ้นบนเบราว์เซอร์ของคุณ",
    "ogImageAlt": "อินเทอร์เฟซเครื่องมือเปลี่ยนสี",
    "twitterTitle": "เปลี่ยนสี - เครื่องมือเปลี่ยนสีภาพออนไลน์ฟรี",
    "twitterDescription": "เปลี่ยนแปลงภาพของคุณด้วยเครื่องมือเปลี่ยนสีที่ทรงพลัง เปลี่ยนสีหลายสี ประมวลผลเป็นชุด และรักษาคุณภาพ"
  },
  "ImageProcessor": {
    "dropToUpload": "วางเพื่ออัปโหลดภาพ",
    "dragAndDrop": "ลากและวางภาพที่นี่ หรือคลิกเพื่ออัปโหลด",
    "supportedFormats": "รองรับไฟล์ PNG, JPG, JPEG, GIF, WEBP ขนาดสูงสุด 5MB ต่อไฟล์",
    "error": {
      "fileTooLarge": "ไฟล์มีขนาดใหญ่เกินไป กรุณาอัปโหลดภาพที่มีขนาดไม่เกิน 5MB",
      "invalidFormat": "กรุณาอัปโหลดไฟล์ภาพที่ถูกต้อง",
      "canvasContext": "ไม่สามารถสร้างบริบทแคนวาสได้",
      "noFilesUploaded": "ไม่มีรูปภาพที่อัปโหลด"
    }
  },
  "Privacy": {
    "title": "นโยบายความเป็นส่วนตัว",
    "description": "นโยบายความเป็นส่วนตัวสำหรับเครื่องมือเปลี่ยนสีภาพ Color Replace",
    "keywords": "นโยบายความเป็นส่วนตัว, การป้องกันข้อมูล, GDPR, ความเป็นส่วนตัวของผู้ใช้, การประมวลผลภาพ",
    "information_collection": {
      "title": "ข้อมูลที่เราเก็บรวบรวม",
      "description": "เราเก็บรวบรวมข้อมูลขั้นต่ำเพื่อให้บริการการเปลี่ยนสี:",
      "uploaded_images": "ภาพที่คุณอัปโหลดเพื่อการเปลี่ยนสี (ประมวลผลในเครื่องในเบราว์เซอร์ของคุณ)",
      "usage_data": "สถิติการใช้งานพื้นฐานและข้อมูลการวิเคราะห์",
      "device_info": "ข้อมูลอุปกรณ์และเบราว์เซอร์สำหรับการเพิ่มประสิทธิภาพบริการ"
    },
    "data_usage": {
      "title": "วิธีการใช้ข้อมูลของคุณ",
      "description": "เราใช้ข้อมูลที่รวบรวมเพื่อวัตถุประสงค์ต่อไปนี้:",
      "provide_service": "เพื่อให้บริการและดูแลรักษาบริการเปลี่ยนสีของเรา",
      "improve_service": "เพื่อปรับปรุงและเพิ่มประสิทธิภาพเครื่องมือของเรา",
      "analytics": "เพื่อทำความเข้าใจรูปแบบการใช้งานและปรับปรุงประสบการณ์ผู้ใช้",
      "advertising": "เพื่อแสดงโฆษณาที่เกี่ยวข้องผ่าน Google AdSense"
    },
    "data_storage": {
      "title": "การจัดเก็บและความปลอดภัยของข้อมูล",
      "description": "ความเป็นส่วนตัวและความปลอดภัยของข้อมูลของคุณเป็นสิ่งสำคัญอันดับแรกของเรา:",
      "temporary": "ภาพที่อัปโหลดจะถูกประมวลผลในเครื่องในเบราว์เซอร์ของคุณและไม่ถูกจัดเก็บบนเซิร์ฟเวอร์ของเรา"
    },
    "third_party": {
      "title": "บริการของบุคคลที่สาม",
      "description": "เราใช้บริการของบุคคลที่สามต่อไปนี้:",
      "analytics": "สำหรับการวิเคราะห์เว็บไซต์และการตรวจสอบประสิทธิภาพ",
      "advertising": "สำหรับการแสดงโฆษณาบนเว็บไซต์ของเรา"
    },
    "cookies": {
      "title": "คุกกี้และการติดตาม",
      "description": "เราใช้คุกกี้และเทคโนโลยีที่คล้ายกันเพื่อปรับปรุงประสบการณ์ของคุณและให้การวิเคราะห์",
      "control": "คุณสามารถควบคุมการตั้งค่าคุกกี้ผ่านการตั้งค่าเบราว์เซอร์หรือแพลตฟอร์มการจัดการความยินยอมของเรา"
    },
    "user_rights": {
      "title": "สิทธิของคุณ",
      "description": "ภายใต้ GDPR และกฎหมายความเป็นส่วนตัวอื่นๆ คุณมีสิทธิต่อไปนี้:",
      "access": "สิทธิในการเข้าถึงข้อมูลส่วนบุคคลของคุณ",
      "correction": "สิทธิในการแก้ไขข้อมูลส่วนบุคคลที่ไม่ถูกต้อง",
      "deletion": "สิทธิในการขอลบข้อมูลส่วนบุคคลของคุณ",
      "portability": "สิทธิในการโอนย้ายข้อมูล"
    },
    "contact": {
      "title": "ติดต่อเรา",
      "description": "หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ กรุณาติดต่อเราผ่านเว็บไซต์ของเรา"
    },
    "updates": {
      "title": "การอัปเดตนโยบาย",
      "description": "เราอาจอัปเดตนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใดๆ โดยการโพสต์นโยบายความเป็นส่วนตัวใหม่บนหน้านี้"
    },
    "last_updated": "อัปเดตล่าสุด"
  },
  "Terms": {
    "title": "เงื่อนไขการให้บริการ",
    "description": "เงื่อนไขการให้บริการสำหรับเครื่องมือเปลี่ยนสีภาพ Color Replace",
    "keywords": "เงื่อนไขการให้บริการ, ข้อตกลงผู้ใช้, เงื่อนไขและข้อกำหนด, เงื่อนไขการให้บริการ",
    "acceptance": {
      "title": "การยอมรับเงื่อนไข",
      "description": "โดยการเข้าถึงและใช้เครื่องมือ Color Replace ของเรา คุณยอมรับและตกลงที่จะผูกพันตามเงื่อนไขและบัญญัติของข้อตกลงนี้"
    },
    "service_description": {
      "title": "คำอธิบายบริการ",
      "description": "Color Replace เป็นเครื่องมือออนไลน์ฟรีที่ให้บริการ:",
      "color_replacement": "ความสามารถในการเปลี่ยนสีและแก้ไขภาพ",
      "image_processing": "การประมวลผลภาพในเครื่องโดยไม่ต้องอัปโหลดไปยังเซิร์ฟเวอร์",
      "free_service": "การเข้าถึงฟรีทุกคุณสมบัติการเปลี่ยนสีพื้นฐาน"
    },
    "user_responsibilities": {
      "title": "ความรับผิดชอบของผู้ใช้",
      "description": "ในฐานะผู้ใช้บริการของเรา คุณตกลงที่จะ:",
      "legal_content": "อัปโหลดและประมวลผลเฉพาะภาพที่คุณมีสิทธิ์ทางกฎหมายในการใช้",
      "copyright": "เคารพลิขสิทธิ์และสิทธิในทรัพย์สินทางปัญญา",
      "appropriate_use": "ใช้บริการเพื่อวัตถุประสงค์ที่ชอบด้วยกฎหมายเท่านั้น",
      "no_harmful_content": "ไม่อัปโหลดเนื้อหาที่เป็นอันตราย, หมิ่นประมาท, หรือไม่เหมาะสม"
    },
    "prohibited_uses": {
      "title": "การใช้งานที่ถูกห้าม",
      "description": "คุณไม่สามารถใช้บริการของเราสำหรับ:",
      "illegal_content": "การประมวลผลเนื้อหาที่ผิดกฎหมายหรือเป็นอันตราย",
      "copyright_violation": "การละเมิดลิขสิทธิ์หรือสิทธิในทรัพย์สินทางปัญญา",
      "malicious_use": "กิจกรรมที่เป็นอันตรายหรือเจตนาทำลาย",
      "system_abuse": "พยายามใช้งานระบบในทางที่ผิดหรือโหลดเกินไป"
    },
    "intellectual_property": {
      "title": "ทรัพย์สินทางปัญญา",
      "description": "เครื่องมือ Color Replace และเนื้อหา คุณสมบัติ และฟังก์ชันการทำงานดั้งเดิมเป็นของเราและได้รับการคุ้มครองภายใต้กฎหมายลิขสิทธิ์, เครื่องหมายการค้า, และกฎหมายทรัพย์สินทางปัญญาสากลอื่นๆ",
      "user_content": "คุณยังคงสิทธิ์ทั้งหมดในภาพที่คุณอัปโหลดและประมวลผลโดยใช้เครื่องมือของเรา"
    },
    "disclaimers": {
      "title": "การปฏิเสธความรับผิด",
      "description": "บริการของเรามีให้บริการตามสภาพ เราไม่ให้การรับประกันใดๆ ทั้งที่แสดงไว้หรือโดยนัย และขอปฏิเสธการรับประกันอื่นๆ ทั้งหมด รวมถึง:",
      "as_is": "บริการมีให้โดยไม่มีการรับประกันใดๆ",
      "availability": "เราไม่รับประกันการบริการที่ไม่ขาดตอนหรือไม่มีข้อผิดพลาด",
      "accuracy": "เราไม่รับประกันความถูกต้องหรือความสมบูรณ์ของผลลัพธ์"
    },
    "limitation_liability": {
      "title": "การจำกัดความรับผิด",
      "description": "ไม่ว่าในกรณีใด Color Replace จะไม่รับผิดชอบต่อความเสียหายทางอ้อม, ตามมา, เฉพาะ, เชิงผลลัพธ์, หรือลงโทษ รวมถึงแต่ไม่จำกัดเพียงการสูญเสียกำไร, ข้อมูล, การใช้งาน, เกียรติภูมิ, หรือความเสียหายอื่นๆ ที่ไม่จับต้องได้"
    },
    "termination": {
      "title": "การสิ้นสุด",
      "description": "เราอาจสิ้นสุดหรือระงับการเข้าถึงของคุณทันที โดยไม่ต้องแจ้งล่วงหน้าหรือรับผิดชอบ ด้วยเหตุผลใดๆ ก็ตาม รวมถึงแต่ไม่จำกัดเพียงหากคุณละเมิดเงื่อนไข"
    },
    "changes": {
      "title": "การเปลี่ยนแปลงเงื่อนไข",
      "description": "เราขอสงวนสิทธิ์ ตามดุลยพินิจของเรา ในการแก้ไขหรือเปลี่ยนเงื่อนไขเหล่านี้ได้ทุกเมื่อ หากมีการแก้ไขที่สำคัญ เราจะพยายามแจ้งล่วงหน้าอย่างน้อย 30 วันก่อนที่เงื่อนไขใหม่จะมีผล"
    },
    "governing_law": {
      "title": "กฎหมายที่บังคับใช้",
      "description": "เงื่อนไขเหล่านี้จะได้รับการตีความและบังคับใช้ตามกฎหมายของเขตอำนาจศาลที่เราดำเนินงาน โดยไม่คำนึงถึงข้อกำหนดด้านความขัดแย้งของกฎหมาย"
    },
    "contact": {
      "title": "ข้อมูลติดต่อ",
      "description": "หากคุณมีคำถามเกี่ยวกับเงื่อนไขการให้บริการเหล่านี้ กรุณาติดต่อเราผ่านเว็บไซต์ของเรา"
    },
    "last_updated": "อัปเดตล่าสุด"
  },
  "Footer": {
    "rights_reserved": "สงวนลิขสิทธิ์ทั้งหมด",
    "privacy_policy": "นโยบายความเป็นส่วนตัว",
    "terms_of_service": "เงื่อนไขการให้บริการ"
  }
}