{
    "HomePage": {
      "title": "Görüntü Renk Değiştirme Aracı - Ücretsiz Çevrimiçi Renk Düzenleyici",
      "originalImages": "Orijinal Görüntüler",
      "processedImages": "İşlenmiş Görüntüler",
      "previewButton": "Önizleme",
      "downloadButton": "İndir",
      "description": "Profesyonel çevrimiçi görüntü renk değiştirme aracı. Aynı anda birden fazla rengi değiştirin, görüntüleri toplu işleyin ve görüntü kalitesini koruyun. Tarayıcıda yerel işleme, yükleme gerektirmez. Tasarımcılar, e-ticaret satıcıları ve pazarlama uzmanları için idealdir.",
      "keywords": "görüntü renk değiştirme,çevrimiçi fotoğraf düzenleyici,renk değiştirme,toplu işleme,ücretsiz görüntü düzenleyici,photoshop çevrimiçi,arka plan kaldırma,grafik tasarım,fotoğraf düzenleme,tasarım araçları"
    },
    "Header": {
      "title": "Renk Değiştir",
      "subtitle": "Profesyonel Çevrimiçi Görüntü Renk Değiştirme Aracı",
      "home": "Ana Sayfa",
      "settings": "Ayarlar",
      "about": "Hakkında"
    },
    "ColorReplaceSettings": {
      "title": "Renk Değiştirme Ayarları",
      "addColorPair": "Renk Çifti Ekle",
      "colorPairTitle": "Renk Çifti #{id}",
      "removeColorPair": "Bu renk çiftini kaldır",
      "sourceColor": "Kaynak Renk",
      "targetColor": "Hedef Renk",
      "toleranceLabel": "Renk Eşleşme Toleransı: {value}%",
      "emptyState": "Henüz renk değiştirme kuralı yok. Başlamak için \"Renk Çifti Ekle\"ye tıklayın",
      "toleranceTitle": "Renk Eşleşme Toleransı",
      "toleranceLow": "Tam",
      "toleranceHigh": "Benzer",
      "replace": "Değiştir",
      "download": "İndir",
      "clearFiles": "Görüntüleri temizle"
    },
    "ColorPicker": {
      "transparent": "şeffaf",
      "useTransparent": "Şeffafı kullan",
      "useColor": "Rengi kullan"
    },
    "EyeDropper": {
      "tooltip": "Renk seçiciyi kullan"
    },
    "ToolDescription": {
      "title": "Ücretsiz Çevrimiçi Görüntü Renk Değiştirme Aracı",
      "mainDescription": "Profesyonel renk değiştirme aracımızla görüntülerinizi anında dönüştürün. Tasarımcılar, pazarlamacılar ve içerik üreticileri için mükemmel bir çözüm - görüntü renklerini hızlı ve verimli bir şekilde değiştirebilirsiniz. Ürün varyasyonları oluşturun, marka renklerini ayarlayın veya tasarım seçeneklerini deneyin; aracımız görüntü kalitesini koruyarak kesin renk manipülasyonu sağlar - her şey doğrudan tarayıcınızda, herhangi bir yükleme gerektirmeden.",
      "features": {
        "title": "Görüntü Renk Düzenleme için Profesyonel Özellikler",
        "feature1": {
          "title": "Akıllı Renk Değiştirme Teknolojisi",
          "description": "Görüntülerinizdeki herhangi bir rengi piksel mükemmelliğinde değiştirin. Gelişmiş renk eşleştirme algoritması, yumuşak geçişler ve profesyonel görünümlü sonuçlar sağlar, ürün fotoğrafları ve tasarım varlıkları için ideal."
        },
        "feature2": {
          "title": "Çoklu Renk Değiştirme",
          "description": "Aynı anda birden fazla rengi değiştirerek zaman kazanın. Marka renk güncellemeleri, tema değişiklikleri ve ürün varyasyonları oluşturmak için ideal. Tüm renk şemalarını bir kerede dönüştürmek için birden fazla renk çifti ekleyin."
        },
        "feature3": {
          "title": "Verimli Toplu İşlem",
          "description": "Güçlü toplu işlem özelliğimizle aynı anda birden fazla görüntüyü işleyin. E-ticaret ürün fotoğrafları, pazarlama materyalleri ve büyük ölçekli tasarım projeleri için mükemmel. Elle düzenleme süresinden saatler kazanın."
        },
        "feature4": {
          "title": "Profesyonel Renk Seçim Araçları",
          "description": "Görüntülerinizden kesin renkleri seçmek için hassas damlalık aracımızı kullanın. Onaltılık kodlar ve RGB değerleriyle uyumlu, marka renklerinizi mükemmel bir şekilde eşleştirmeyi kolaylaştırır."
        },
        "feature5": {
          "title": "Gelişmiş Renk Eşleştirme Kontrolleri",
          "description": "Zeki benzerlik kontrolleriyle renk değişimlerinizi hassasça ayarlayın. Gradyanları, gölgeleri ve karmaşık renk varyasyonlarını işlemek için ideal, doğal görünümlü sonuçları korur."
        },
        "feature6": {
          "title": "Güvenli Yerel İşleme",
          "description": "Tarayıcınızda hızlı ve güvenli görüntü işlemeyi deneyimleyin. Dosya yüklemeye gerek yok - görüntüleriniz asla cihazınızı terk etmez, tam gizlilik ve anında sonuçlar garanti edilir."
        }
      },
      "privacyTitle": "% 100 Gizli ve Güvenli",
      "privacyDescription": "Gizliliğiniz ve veri güvenliğiniz bizim en üst önceliğimizdir. Diğer çevrimiçi araçların aksine, görüntü işlemcimiz tamamen tarayıcınızda çalışır - görüntüleriniz asla herhangi bir sunucuya yüklenmez. Hassas tasarım varlıklarınızın cihazınızda özel ve güvenli kalacağını bilerek güvenle çalışın."
    },
    "UsageExamples": {
      "title": "Renk Değiştirme Örnekleri",
      "subtitle": "Görüntü Renk Düzenleme Senaryoları",
      "examples": [
        {
          "title": "Marka Kimliği Yenileme",
          "description": "Şirket logosunun veya pazarlama materyallerinin renklerini anında değiştirin. Marka renk paletinizi hızlıca güncelleyin ve tutarlı bir görsel kimlik oluşturun.",
          "tags": ["marka tasarımı", "pazarlama", "kurumsal kimlik"]
        },
        {
          "title": "Fotoğraf Renk Düzeltme",
          "description": "Eski fotoğrafların renklerini canlandırın veya dijital görüntülerin ton ve renklerini profesyonelce ayarlayın. Nostaljik anıları yeniden renklendirebilir veya görüntülerin görsel etkisini artırabilirsiniz.",
          "tags": ["fotoğraf düzenleme", "renk düzeltme", "görüntü restorasyonu"]
        },
        {
          "title": "Grafik Tasarım Uygulamaları",
          "description": "Dijital sanat, illüstrasyon ve grafik tasarım projelerinde renkleri hızlıca değiştirin. Yaratıcı vizyonunuzu anında gerçekleştirin ve tasarım iş akışınızı optimize edin.",
          "tags": ["dijital sanat", "illüstrasyon", "grafik tasarım"]
        },
        {
          "title": "E-Ticaret Ürün Görüntüleri",
          "description": "Ürün görüntülerinin renklerini çeşitli varyasyonlar için hızlıca ayarlayın. Farklı renk seçeneklerini göstermek için görüntüleri kolayca değiştirin ve müşteri deneyimini geliştirin.",
          "tags": ["e-ticaret", "ürün görüntüleri", "pazarlama"]
        },
        {
          "title": "Web ve Dijital Medya İçeriği",
          "description": "Web siteleri, sosyal medya gönderileri ve dijital reklamlar için görüntü renklerini optimize edin. Marka estetiğinizi güçlendirin ve içeriğinizin görsel çekiciliğini artırın.",
          "tags": ["web tasarımı", "sosyal medya", "dijital pazarlama"]
        }
      ],
      "howToUse": {
        "title": "Renk Değiştirme Aracını Kullanma Kılavuzu",
        "steps": [
          {
            "step": 1,
            "title": "Görüntü Yükleme",
            "description": "PNG, JPG veya WebP formatındaki görüntüyü sürükleyip bırakın veya dosya seçiciyi kullanarak yükleyin."
          },
          {
            "step": 2,
            "title": "Renk Seçimi",
            "description": "Değiştirmek istediğiniz orijinal rengi seçin. Renk seçici veya göz damlatıcı aracını kullanarak kesin rengi belirleyin."
          },
          {
            "step": 3,
            "title": "Yeni Renk Atama",
            "description": "Orijinal renkle değiştirilecek yeni rengi seçin. Renk paletinden veya özel renk girişinden faydalanabilirsiniz."
          },
          {
            "step": 4,
            "title": "Tolerans Ayarlama",
            "description": "Renk değişiminin hassasiyetini ayarlamak için tolerans kaydırıcısını kullanın. Benzer tonları yakalamak için ayarları optimize edin."
          },
          {
            "step": 5,
            "title": "Önizleme ve İndirme",
            "description": "Değişiklikleri önizleyin ve memnun kalınca görüntüyü yüksek kalitede indirin."
          }
        ]
      },
      "tips": {
        "title": "Profesyonel Renk Değiştirme İpuçları",
        "items": [
          {
            "title": "Renk Toleransını Anlama",
            "description": "Tolerans ayarını doğru kullanarak benzer renk tonlarını yakalayın. Düşük tolerans kesin renk değişimi, yüksek tolerans daha yumuşak geçişler sağlar."
          },
          {
            "title": "Çoklu Renk Değişimi",
            "description": "Aynı anda birden fazla rengi değiştirebilirsiniz. Karmaşık görüntülerde bile hızlı ve verimli renk düzenlemesi yapın."
          },
          {
            "title": "Detayları Koruma",
            "description": "Gelişmiş ayarları kullanarak görüntü detaylarını ve kalitesini koruyun. Renk değişimi sırasında görüntü bütünlüğünü muhafaza edin."
          }
        ]
      }
    },
    "Metadata": {
      "title": "Renk Değiştir - Ücretsiz Çevrimiçi Görüntü Renk Değiştirme Aracı",
      "titleTemplate": "%s | Renk Değiştir - Görüntü Renk Düzenleyici",
      "description": "Görüntü renklerini kesin olarak değiştirmek için ücretsiz çevrimiçi araç. Aynı anda birden fazla rengi değiştirin, görüntüleri toplu işleme alın ve görüntü kalitesini koruyun. Yükleme gerekmiyor - tarayıcıda yerel olarak işleyin",
      "keywords": [
        "renk değiştir",
        "görüntü renk düzenleyici",
        "renk değiştirme aracı",
        "toplu görüntü işleme",
        "görüntü renk değiştiricisi",
        "renk değişim aracı",
        "görüntü düzenleme",
        "tasarım aracı"
      ],
      "locale": "tr_TR",
      "ogTitle": "Renk Değiştir - Ücretsiz Çevrimiçi Görüntü Renk Değiştirme Aracı",
      "ogDescription": "Güçlü renk değiştirme aracımızla görüntülerinizi dönüştürün. Birden fazla rengi değiştirin, görüntüleri toplu işleme alın ve kaliteyi koruyun. Yükleme gerekmiyor - tüm işlemler tarayıcınızda gerçekleşir.",
      "ogImageAlt": "Renk Değiştir Araç Arayüzü",
      "twitterTitle": "Renk Değiştir - Ücretsiz Çevrimiçi Görüntü Renk Değiştirme Aracı",
      "twitterDescription": "Güçlü renk değiştirme aracımızla görüntülerinizi dönüştürün. Birden fazla rengi değiştirin, görüntüleri toplu işleme alın ve kaliteyi koruyun."
    },
    "ImageProcessor": {
      "dropToUpload": "Yüklemek için görüntüleri bırakın",
      "dragAndDrop": "Görüntüleri buraya sürükleyip bırakın",
      "supportedFormats": "PNG, JPG, JPEG, GIF, WEBP formatlarını destekler, dosya başına maksimum 5MB",
      "uploadError": {
        "fileType": "Desteklenmeyen dosya türü. Yalnızca JPG, PNG veya WebP görüntüleri yükleyin.",
        "fileSize": "Dosya çok büyük. Maksimum 10 MB'a kadar izin verilir.",
        "processingError": "Görüntü işleme sırasında hata oluştu. Tekrar deneyin veya başka bir görüntü yükleyin.",
        "noFilesUploaded": "Hiç görüntü yüklenmedi"
      }
    },
    "Privacy": {
      "title": "Gizlilik Politikası",
      "description": "Color Replace görüntü renk değiştirme aracı için gizlilik politikası",
      "keywords": "gizlilik politikası, veri koruma, GDPR, kullanıcı gizliliği, görüntü işleme",
      "information_collection": {
        "title": "Topladığımız Bilgiler",
        "description": "Renk değiştirme hizmetimizi sağlamak için minimum bilgi topluyoruz:",
        "uploaded_images": "Renk değiştirme için yüklediğiniz görüntüler (tarayıcınızda yerel olarak işlenir)",
        "usage_data": "Temel kullanım istatistikleri ve analiz verileri",
        "device_info": "Hizmet optimizasyonu için cihaz ve tarayıcı bilgileri"
      },
      "data_usage": {
        "title": "Verilerinizi Nasıl Kullanıyoruz",
        "description": "Topladığımız bilgileri aşağıdaki amaçlar için kullanıyoruz:",
        "provide_service": "Renk değiştirme hizmetimizi sağlamak ve sürdürmek için",
        "improve_service": "Aracımızın performansını iyileştirmek ve optimize etmek için",
        "analytics": "Kullanım kalıplarını anlamak ve kullanıcı deneyimini geliştirmek için",
        "advertising": "Google AdSense aracılığıyla ilgili reklamlar göstermek için"
      },
      "data_storage": {
        "title": "Veri Depolama ve Güvenlik",
        "description": "Gizliliğiniz ve veri güvenliğiniz bizim en üst önceliğimizdir:",
        "temporary": "Yüklenen görüntüler tarayıcınızda yerel olarak işlenir ve sunucularımızda depolanmaz"
      },
      "third_party": {
        "title": "Üçüncü Taraf Hizmetleri",
        "description": "Aşağıdaki üçüncü taraf hizmetlerini kullanıyoruz:",
        "analytics": "Web sitesi analizi ve performans izleme için",
        "advertising": "Web sitemizde reklam göstermek için"
      },
      "cookies": {
        "title": "Çerezler ve İzleme",
        "description": "Deneyiminizi geliştirmek ve analiz sağlamak için çerezler ve benzer teknolojiler kullanıyoruz.",
        "control": "Çerez tercihlerinizi tarayıcı ayarlarınız veya rıza yönetim platformumuz aracılığıyla kontrol edebilirsiniz."
      },
      "user_rights": {
        "title": "Haklarınız",
        "description": "GDPR ve diğer gizlilik yasaları uyarınca aşağıdaki haklara sahipsiniz:",
        "access": "Kişisel verilerinize erişim hakkı",
        "correction": "Yanlış kişisel verileri düzeltme hakkı",
        "deletion": "Kişisel verilerinizin silinmesini talep etme hakkı",
        "portability": "Veri taşınabilirliği hakkı"
      },
      "contact": {
        "title": "Bizimle İletişime Geçin",
        "description": "Bu Gizlilik Politikası hakkında sorularınız varsa, lütfen web sitemiz aracılığıyla bizimle iletişime geçin."
      },
      "updates": {
        "title": "Politika Güncellemeleri",
        "description": "Bu Gizlilik Politikasını zaman zaman güncelleyebiliriz. Değişiklikleri bu sayfada yeni Gizlilik Politikasını yayınlayarak size bildireceğiz."
      },
      "last_updated": "Son güncelleme"
    },
    "Terms": {
      "title": "Hizmet Şartları",
      "description": "Color Replace görüntü renk değiştirme aracı için hizmet şartları",
      "keywords": "hizmet şartları, kullanıcı sözleşmesi, şartlar ve koşullar, hizmet koşulları",
      "acceptance": {
        "title": "Şartları Kabul Etme",
        "description": "Color Replace aracımıza erişerek ve kullanarak, bu anlaşmanın şart ve hükümlerine bağlı kalmayı kabul edersiniz."
      },
      "service_description": {
        "title": "Hizmet Açıklaması",
        "description": "Color Replace, aşağıdakileri sağlayan ücretsiz bir çevrimiçi araçtır:",
        "color_replacement": "Görüntü renk değiştirme ve düzenleme yetenekleri",
        "image_processing": "Sunucu yükleme olmadan yerel görüntü işleme",
        "free_service": "Tüm temel renk değiştirme özelliklerine ücretsiz erişim"
      },
      "user_responsibilities": {
        "title": "Kullanıcı Sorumlulukları",
        "description": "Hizmetimizin kullanıcısı olarak, aşağıdakileri kabul edersiniz:",
        "legal_content": "Sadece kullanma hakkına sahip olduğunuz görüntüleri yüklemek ve işlemek",
        "copyright": "Telif haklarına ve fikri mülkiyet haklarına saygı göstermek",
        "appropriate_use": "Hizmeti sadece yasal amaçlar için kullanmak",
        "no_harmful_content": "Zararlı, rahatsız edici veya uygunsuz içerik yüklememek"
      },
      "prohibited_uses": {
        "title": "Yasak Kullanımlar",
        "description": "Hizmetimizi aşağıdaki amaçlar için kullanamazsınız:",
        "illegal_content": "Yasadışı veya zararlı içerik işlemek",
        "copyright_violation": "Telif haklarını veya fikri mülkiyet haklarını ihlal etmek",
        "malicious_use": "Herhangi bir kötü niyetli veya zararlı faaliyet",
        "system_abuse": "Sistemlerimizi kötüye kullanmaya veya aşırı yüklemeye çalışmak"
      },
      "intellectual_property": {
        "title": "Fikri Mülkiyet",
        "description": "Color Replace aracı ve orijinal içeriği, özellikleri ve işlevleri bize aittir ve uluslararası telif hakkı, ticari marka ve diğer fikri mülkiyet yasaları tarafından korunmaktadır.",
        "user_content": "Aracımızı kullanarak yüklediğiniz ve işlediğiniz görüntülerdeki tüm hakları saklı tutarsınız."
      },
      "disclaimers": {
        "title": "Feragatnameler",
        "description": "Hizmetimiz 'olduğu gibi' sağlanmaktadır. Hiçbir garanti, açık veya zımni vermiyoruz ve burada diğer tüm garantileri reddediyoruz:",
        "as_is": "Hizmet herhangi bir garanti olmaksızın sağlanmaktadır",
        "availability": "Kesintisiz veya hatasız hizmet garantisi vermiyoruz",
        "accuracy": "Sonuçların doğruluğunu veya eksiksizliğini garanti etmiyoruz"
      },
      "limitation_liability": {
        "title": "Sorumluluğun Sınırlanması",
        "description": "Hiçbir durumda Color Replace, kâr, veri, kullanım, itibar veya diğer maddi olmayan zararların kaybı dahil ancak bunlarla sınırlı olmamak üzere, dolaylı, arızi, özel, sonuçsal veya cezai zararlardan sorumlu olmayacaktır."
      },
      "termination": {
        "title": "Feshetme",
        "description": "Şartları ihlal etmeniz dahil ancak bununla sınırlı olmamak üzere, herhangi bir nedenle, önceden bildirim veya sorumluluk olmaksızın erişiminizi hemen sonlandırabilir veya askıya alabiliriz."
      },
      "changes": {
        "title": "Şartlardaki Değişiklikler",
        "description": "Bu Şartları her zaman kendi takdirimize bağlı olarak değiştirme veya değiştirme hakkını saklı tutarız. Bir revizyon önemli ise, yeni şartlar yürürlüğe girmeden önce en az 30 gün önceden bildirim vermeye çalışacağız."
      },
      "governing_law": {
        "title": "Yürüten Hukuk",
        "description": "Bu Şartlar, çalıştığımız yargı bölgesinin yasalarına göre yorumlanacak ve yönetilecektir, kanun çatışması hükümlerine bakılmaksızın."
      },
      "contact": {
        "title": "İletişim Bilgileri",
        "description": "Bu Hizmet Şartları hakkında sorularınız varsa, lütfen web sitemiz aracılığıyla bizimle iletişime geçin."
      },
      "last_updated": "Son güncelleme"
    },
    "Footer": {
      "rights_reserved": "Tüm hakları saklıdır.",
      "privacy_policy": "Gizlilik Politikası",
      "terms_of_service": "Hizmet Şartları"
    }
  }