{
  "HomePage": {
    "title": "رنگ تبدیلی ٹول - مفت آن لائن رنگ ایڈیٹر",
    "originalImages": "اصل تصاویر",
    "processedImages": "پروسیس شدہ تصاویر",
    "previewButton": "پیش نظارہ",
    "downloadButton": "ڈاؤن لوڈ",
    "description": "پیشہ ورانہ آن لائن تصویر رنگ تبدیلی ٹول۔ متعدد رنگوں کو ایک ساتھ تبدیل کریں، تصاویر کو بیچ میں پروسیس کریں اور تصویر کی معیار کو برقرار رکھیں۔ براؤزر میں مقامی پروسیسنگ، کوئی اپ لوڈ درکار نہیں۔ ڈیزائنرز، ای کامرس سیلرز اور مارکیٹنگ پیشہ وروں کے لیے مثالی۔",
    "keywords": "تصویر رنگ تبدیلی,آن لائن تصویر ایڈیٹر,رنگ تبدیلی,بیچ پروسیسنگ,مفت تصویر ایڈیٹر,فوٹوشاپ آن لائن,بیک گراؤنڈ ہٹانا,گرافک ڈیزائن,تصویر ایڈیٹنگ,ڈیزائن ٹولز"
  },
  "Header": {
    "title": "رنگ تبدیل کریں",
    "subtitle": "پیشہ ورانہ آن لائن تصویر رنگ تبدیلی ٹول",
    "home": "مرکزی صفحہ",
    "settings": "ترتیبات",
    "about": "ہمارے بارے میں"
  },
  "ColorReplaceSettings": {
    "title": "رنگ تبدیلی کی ترتیبات",
    "addColorPair": "رنگ کی جوڑی شامل کریں",
    "colorPairTitle": "رنگ کی جوڑی #{id}",
    "removeColorPair": "اس رنگ کی جوڑی کو ہٹائیں",
    "sourceColor": "ابتدائی رنگ",
    "targetColor": "مقصدی رنگ",
    "toleranceLabel": "رنگ میل کی رواداری: {value}٪",
    "emptyState": "کوئی رنگ تبدیلی کے قاعدے نہیں۔ شروع کرنے کے لیے \"رنگ کی جوڑی شامل کریں\" پر کلک کریں",
    "toleranceTitle": "رنگ میل کی رواداری",
    "toleranceLow": "بالکل درست",
    "toleranceHigh": "مشابہ",
    "replace": "تبدیل کریں",
    "download": "ڈاؤن لوڈ",
    "clearFiles": "تصاویر صاف کریں"
  },
  "ColorPicker": {
    "transparent": "شفاف",
    "useTransparent": "شفافیت استعمال کریں",
    "useColor": "رنگ استعمال کریں"
  },
  "EyeDropper": {
    "tooltip": "رنگ چننے والا ٹول استعمال کریں"
  },
  "ToolDescription": {
    "title": "مفت آن لائن تصویر رنگ تبدیلی ٹول",
    "mainDescription": "اپنی تصاویر کو فوری طور پر ہماری پیشہ ورانہ رنگ تبدیلی ٹول کے ساتھ تبدیل کریں۔ ڈیزائنرز، مارکیٹرز اور مواد تخلیق کنندگان کے لیے بہترین جو تصویر کے رنگوں کو تیزی اور موثر طریقے سے تبدیل کرنا چاہتے ہیں۔ چاہے آپ مصنوعات کی قسموں، برانڈ کے رنگوں کو ایڈجسٹ کر رہے ہوں، یا ڈیزائن کے اختیارات کے ساتھ تجربہ کر رہے ہوں، ہمارا ٹول تصویر کی کوالٹی کو برقرار رکھتے ہوئے رنگوں کی درست تبدیلی فراہم کرتا ہے - یہ سب براؤزر میں سیدھا، بغیر کسی اپ لوڈ کے۔",
    "features": {
      "title": "تصویر رنگ ایڈیٹنگ کی پیشہ ورانہ خصوصیات",
      "feature1": {
        "title": "ذہین رنگ تبدیلی ٹیکنالوجی",
        "description": "اپنی تصاویر میں کسی بھی رنگ کو پکسل کی بالکل درست صحت کے ساتھ تبدیل کریں۔ ہمارا جدید رنگ میل الگورتھم ہموار منتقلی اور پیشہ ورانہ نظر آنے والے نتائج کو یقینی بناتا ہے، جو مصنوعات کی تصاویر اور ڈیزائن اثاثوں کے لیے بہترین ہے۔"
      },
      "feature2": {
        "title": "ملٹی-رنگ تبدیلی",
        "description": "متعدد رنگوں کو ایک ساتھ تبدیل کرکے وقت بچائیں۔ برانڈ کے رنگ اپ ڈیٹ کرنے، تھیم میں تبدیلی کرنے اور مصنوعات کی قسموں کو بنانے کے لیے بہترین۔ پورے رنگ سکیم کو ایک بار میں تبدیل کرنے کے لیے متعدد رنگ کی جوڑیاں شامل کریں۔"
      },
      "feature3": {
        "title": "موثر بیچ پروسیسنگ",
        "description": "اپنی طاقتور بیچ پروسیسنگ خصوصیت کے ساتھ متعدد تصاویر کو ایک ساتھ پروسیس کریں۔ ای-کامرس مصنوعات کی تصاویر، مارکیٹنگ مواد اور بڑے ڈیزائن پروجیکٹس کے لیے بہترین۔ دستی ایڈیٹنگ کے وقت میں گھنٹے بچائیں۔"
      },
      "feature4": {
        "title": "پیشہ ورانہ رنگ انتخاب ٹولز",
        "description": "اپنی تصاویر سے درست رنگ چننے کے لیے ہمارے درست آنکھ چننے والے ٹول کا استعمال کریں۔ ہیکس کوڈز اور آر جی بی اقدار کے ساتھ مطابق، اپنے برانڈ کے رنگوں کو بالکل درست طریقے سے میچ کرنا آسان۔"
      },
      "feature5": {
        "title": "جدید رنگ میل کنٹرولز",
        "description": "اپنے رنگ تبدیلیوں کو ہماری ذہین مشابہت کنٹرولز کے ساتھ ٹھیک کریں۔ گریڈینٹس، پردوں اور پیچیدہ رنگ کی تغیرات کو سنبھالنے کے لیے بہترین، جبکہ قدرتی نظر آنے والے نتائج کو برقرار رکھا جاتا ہے۔"
      },
      "feature6": {
        "title": "محفوظ مقامی پروسیسنگ",
        "description": "اپنے براؤزر میں تیز، محفوظ تصویر پروسیسنگ کا تجربہ کریں۔ کسی فائل اپ لوڈ کی ضرورت نہیں - آپ کی تصاویر کبھی بھی آپ کے آلے سے باہر نہیں جاتیں، مکمل رازداری اور فوری نتائج کو یقینی بناتے ہوئے۔"
      }
    },
    "privacyTitle": "100٪ نجی اور محفوظ",
    "privacyDescription": "آپ کی رازداری اور ڈیٹا سلامتی ہماری سب سے اہم ترجیح ہے۔ دوسرے آن لائن ٹولز کے برعکس، ہمارا تصویر پروسیسر مکمل طور پر آپ کے براؤزر میں کام کرتا ہے - آپ کی تصاویر کبھی بھی کسی سرور پر اپ لوڈ نہیں کی جاتیں۔ اعتماد کے ساتھ کام کریں، یہ جانتے ہوئے کہ آپ کے حساس ڈیزائن اثاثے آپ کے آلے پر نجی اور محفوظ رہتے ہیں۔"
  },
  "UsageExamples": {
    "title": "استعمال کے مثالی نمونے",
    "description": "ہماری رنگ تبدیلی ٹول کی کارکردگی کو دیکھیں اور دریافت کریں۔ مختلف سیناریوز میں کس طرح یہ ٹول آپ کے ڈیزائن اور مارکیٹنگ کام کو آسان بنا سکتا ہے۔",
    "examples": [
      {
        "title": "مصنوعات کی رنگ ویریئیشن",
        "description": "ای-کامرس پلیٹ فارمز کے لیے مصنوعات کی متعدد رنگ کی قسموں کو آسانی سے بنائیں۔ ایک ہی تصویر سے مختلف رنگوں میں مصنوعات کو تیار کریں، جس سے آپ کی مصنوعات کی رینج میں توسیع ہو اور فروخت کے امکانات بڑھ جائیں۔"
      },
      {
        "title": "برانڈ کی رنگ اپ ڈیٹس",
        "description": "اپنے برانڈ کی تصویری شناخت کو فوری طور پر اپ ڈیٹ کریں۔ مارکیٹنگ مواد، سوشل میڈیا گرافکس، اور پروڈکٹ تصاویر میں برانڈ کے رنگوں کو مکمل طور پر مطابق بنائیں۔ کسی بھی موسم یا مہم کے لیے اپنے برانڈ کی تصاویر کو تیزی سے ایڈجسٹ کریں۔"
      },
      {
        "title": "ڈیزائن تجربہ کاری",
        "description": "اپنے ڈیزائن کے مختلف رنگ سکیموں کے ساتھ تجربہ کریں۔ مختلف رنگ کمبینیشنز کو آزمائیں، رنگ کی مشابہت کے کنٹرولز کا استعمال کرتے ہوئے نرم انتقالات کو یقینی بنائیں۔ اپنے ڈیزائن کو بہتر بنانے کے لیے رنگوں کے مختلف نظریات کو آزمائیں۔"
      },
      {
        "title": "مارکیٹنگ مواد کی اپٹیمائزیشن",
        "description": "مختلف مارکیٹنگ مہموں کے لیے تصاویر کو تیزی سے اپ ڈیٹ کریں۔ موسمی مہموں، سیل، یا نئے پروڈکٹ لانچز کے لیے اپنے مارکیٹنگ گرافکس کو فوری طور پر ایڈجسٹ کریں۔ ہر مہم کے لیے مخصوص رنگ سکیم بنائیں۔"
      },
      {
        "title": "ڈیجیٹل میڈیا ایڈیٹنگ",
        "description": "سوشل میڈیا پوسٹس، بلاگ تصاویر، اور ویب کنٹینٹ کے لیے رنگوں کو آسانی سے تبدیل کریں۔ اپنے ڈیجیٹل مواد کو مختلف پلیٹ فارمز اور آڈینس کے لیے اپ ڈیٹ کریں۔ ہر پلیٹ فارم کے لیے مخصوص رنگ کی ترجیحات کو برقرار رکھیں۔"
      },
      {
        "title": "ڈیزائن اثاثوں کی توانائی",
        "description": "ڈیزائن اثاثوں کی بڑی تعداد کو تیزی سے اپ ڈیٹ کریں۔ بیچ پروسیسنگ کی خصوصیت کا استعمال کرتے ہوئے، متعدد تصاویر کے رنگوں کو ایک ساتھ تبدیل کریں۔ وقت کی بچت کریں اور اپنی ڈیزائن ورکفلو کو بہتر بنائیں۔"
      }
    ]
  },
  "Metadata": {
    "title": "رنگ تبدیل کریں - مفت آن لائن تصویر رنگ تبدیلی ٹول",
    "description": "مفت آن لائن تصویر رنگ تبدیلی ٹول۔ ڈیزائنرز، مارکیٹرز اور کریٹیو پروفیشنلز کے لیے پیشہ ورانہ رنگ تبدیلی۔ براؤزر میں تیز، محفوظ اور آسان تصویر رنگ تبدیلی۔ کوئی اپ لوڈ نہیں، پکسل پرفیکٹ نتائج۔",
    "keywords": [
      "رنگ تبدیلی",
      "تصویر رنگ ایڈیٹر",
      "مفت آن لائن رنگ تبدیلی",
      "پیشہ ورانہ رنگ ٹول",
      "براؤزر میں رنگ تبدیلی",
      "ڈیزائن رنگ تبدیلی",
      "مارکیٹنگ رنگ ٹول",
      "تصویر رنگ تبدیلی",
      "ای-کامرس رنگ ایڈیٹر",
      "برانڈ رنگ تبدیلی"
    ],
    "ogTitle": "رنگ تبدیل کریں - مفت پیشہ ورانہ تصویر رنگ تبدیلی",
    "ogDescription": "تصاویر کو آسانی سے اور تیزی سے تبدیل کریں۔ پکسل پرفیکٹ رنگ تبدیلی، کوئی اپ لوڈ نہیں، براؤزر میں مکمل رازداری۔",
    "twitterTitle": "رنگ تبدیل کریں - پیشہ ورانہ تصویر رنگ ایڈیٹر",
    "twitterDescription": "تصاویر کو آسانی سے تبدیل کریں۔ مفت، تیز اور محفوظ رنگ تبدیلی ٹول۔ کوئی اپ لوڈ نہیں، پکسل پرفیکٹ نتائج۔"
  },
  "ImageProcessor": {
    "dropToUpload": "تصاویر اپ لوڈ کرنے کے لیے چھوڑ دیں",
    "dragAndDrop": "تصاویر کو یہاں کھینچ کر چھوڑ دیں یا",
    "pasteImage": "تصویر پیسٹ کریں",
    "supportedFormats": "PNG، JPG، JPEG، GIF، WEBP فارمیٹس کی حمایت کرتا ہے، فائل کے لیے زیادہ سے زیادہ 5MB",
    "error": {
      "fileTooLarge": "فائل بہت بڑی ہے، براہ کرم 5MB سے کم سائز کی تصاویر اپ لوڈ کریں",
      "invalidFormat": "براہ کرم درست تصویری فائلیں اپ لوڈ کریں",
      "canvasContext": "کینوس کا سیاق و سباق نہیں بنا سکتے",
      "noFilesUploaded": "کوئی تصویر اپ لوڈ نہیں کی گئی"
    }
  },
  "Privacy": {
    "title": "رازداری کی پالیسی",
    "description": "رنگ تبدیل تصویر رنگ تبدیلی ٹول کے لیے رازداری کی پالیسی",
    "keywords": "رازداری کی پالیسی, ڈیٹا تحفظ, جی ڈی پی آر, صارف کی رازداری, تصویر پروسیسنگ",
    "information_collection": {
      "title": "ہم جو معلومات جمع کرتے ہیں",
      "description": "ہم رنگ تبدیلی سروس فراہم کرنے کے لیے کم از کم معلومات جمع کرتے ہیں:",
      "uploaded_images": "تصاویر جو آپ رنگ تبدیلی کے لیے اپ لوڈ کرتے ہیں (آپ کے براؤزر میں مقامی طور پر پروسیس ہوتی ہیں)",
      "usage_data": "بنیادی استعمال کے اعداد و شمار اور تجزیاتی ڈیٹا",
      "device_info": "سروس کی بہتری کے لیے آلہ اور براؤزر کی معلومات"
    },
    "data_usage": {
      "title": "ہم آپ کا ڈیٹا کیسے استعمال کرتے ہیں",
      "description": "ہم جمع کردہ معلومات مندرجہ ذیل مقاصد کے لیے استعمال کرتے ہیں:",
      "provide_service": "ہماری رنگ تبدیلی سروس فراہم کرنے اور برقرار رکھنے کے لیے",
      "improve_service": "ہمارے ٹول کی کارکردگی کو بہتر بنانے اور بہترین بنانے کے لیے",
      "analytics": "استعمال کے پیٹرن کو سمجھنے اور صارف کے تجربے کو بہتر بنانے کے لیے",
      "advertising": "گوگل ایڈ سینس کے ذریعے متعلقہ اشتہارات دکھانے کے لیے"
    },
    "data_storage": {
      "title": "ڈیٹا اسٹوریج اور سیکیورٹی",
      "description": "آپ کی رازداری اور ڈیٹا سیکیورٹی ہماری سب سے اہم ترجیح ہے:",
      "temporary": "اپ لوڈ کی گئی تصاویر آپ کے براؤزر میں مقامی طور پر پروسیس ہوتی ہیں اور ہمارے سرورز پر محفوظ نہیں ہوتیں"
    },
    "third_party": {
      "title": "تیسری پارٹی سروسز",
      "description": "ہم مندرجہ ذیل تیسری پارٹی سروسز استعمال کرتے ہیں:",
      "analytics": "ویب سائٹ کے تجزیات اور کارکردگی کی نگرانی کے لیے",
      "advertising": "ہماری ویب سائٹ پر اشتہارات دکھانے کے لیے"
    },
    "cookies": {
      "title": "کوکیز اور ٹریکنگ",
      "description": "ہم آپ کے تجربے کو بہتر بنانے اور تجزیات فراہم کرنے کے لیے کوکیز اور اسی طرح کی ٹیکنالوجیز استعمال کرتے ہیں۔",
      "control": "آپ اپنے براؤزر کی ترتیبات یا ہماری منظوری انتظام پلیٹ فارم کے ذریعے کوکی کی ترجیحات کو کنٹرول کر سکتے ہیں۔"
    },
    "user_rights": {
      "title": "آپ کے حقوق",
      "description": "جی ڈی پی آر اور دوسری رازداری کے قوانین کے تحت، آپ کے پاس مندرجہ ذیل حقوق ہیں:",
      "access": "آپ کے ذاتی ڈیٹا تک رسائی کا حق",
      "correction": "غلط ذاتی ڈیٹا کی اصلاح کا حق",
      "deletion": "آپ کے ذاتی ڈیٹا کو حذف کرنے کی درخواست کا حق",
      "portability": "ڈیٹا پورٹیبلٹی کا حق"
    },
    "contact": {
      "title": "ہم سے رابطہ کریں",
      "description": "اگر آپ کے پاس اس رازداری کی پالیسی کے بارے میں کوئی سوالات ہیں، تو براہ کرم ہم سے ہماری ویب سائٹ کے ذریعے رابطہ کریں۔"
    },
    "updates": {
      "title": "پالیسی کی تازہ کاریاں",
      "description": "ہم اس رازداری کی پالیسی کو وقت کے ساتھ اپ ڈیٹ کر سکتے ہیں۔ ہم کسی بھی تبدیلی کو اس صفحہ پر نئی رازداری کی پالیسی پوسٹ کرکے آپ کو اطلاع دیں گے۔"
    },
    "last_updated": "آخری بار اپ ڈیٹ کیا"
  },
  "Terms": {
    "title": "سروس کی شرائط",
    "description": "رنگ تبدیل تصویر رنگ تبدیلی ٹول کے لیے سروس کی شرائط",
    "keywords": "سروس کی شرائط, صارف کا معاہدہ, شرائط و ضوابط, سروس کی شرائط",
    "acceptance": {
      "title": "شرائط کی قبولیت",
      "description": "ہماری رنگ تبدیل ٹول تک رسائی حاصل کرکے اور اسے استعمال کرکے، آپ اس معاہدے کی شرائط اور احکامات کی پابندی کو قبول کرتے ہیں اور اس سے بندھنے پر متفق ہیں۔"
    },
    "service_description": {
      "title": "سروس کی تفصیل",
      "description": "رنگ تبدیل ایک مفت آن لائن ٹول ہے جو فراہم کرتا ہے:",
      "color_replacement": "تصویر رنگ تبدیلی اور ایڈیٹنگ کی صلاحیتیں",
      "image_processing": "سرور اپ لوڈ کے بغیر مقامی تصویر پروسیسنگ",
      "free_service": "تمام بنیادی رنگ تبدیلی خصوصیات تک مفت رسائی"
    },
    "user_responsibilities": {
      "title": "صارف کی ذمہ داریاں",
      "description": "ہماری سروس کے صارف کے طور پر، آپ متفق ہیں:",
      "legal_content": "صرف ان تصاویر کو اپ لوڈ اور پروسیس کریں جنہیں استعمال کرنے کا قانونی حق آپ کے پاس ہے",
      "copyright": "کاپی رائٹ اور ذہنی ملکیت کے حقوق کا احترام کریں",
      "appropriate_use": "سروس کو صرف قانونی مقاصد کے لیے استعمال کریں",
      "no_harmful_content": "ہذیانی، پرتشدد، یا نامناسب مواد اپ لوڈ نہ کریں"
    },
    "prohibited_uses": {
      "title": "منع شدہ استعمال",
      "description": "آپ ہماری سروس کو مندرجہ ذیل مقاصد کے لیے استعمال نہیں کر سکتے:",
      "illegal_content": "غیر قانونی یا ہذیانی مواد کو پروسیس کرنا",
      "copyright_violation": "کاپی رائٹ یا ذہنی ملکیت کے حقوق کی خلاف ورزی کرنا",
      "malicious_use": "کوئی بھی بدکار یا نقصان دہ سرگرمیاں",
      "system_abuse": "ہمارے سسٹمز کا غلط استعمال یا زیادہ لوڈ کرنے کی کوشش کرنا"
    },
    "intellectual_property": {
      "title": "ذہنی ملکیت",
      "description": "رنگ تبدیل ٹول اور اس کا اصل مواد، خصوصیات، اور فعالیت ہمارے ملکیت ہے اور بین الاقوامی کاپی رائٹ، ٹریڈ مارک، اور دوسری ذہنی ملکیت کے قوانین کے تحت محفوظ ہے۔",
      "user_content": "آپ اپنے اپ لوڈ اور پروسیس کردہ تصاویر کے تمام حقوق برقرار رکھتے ہیں۔"
    },
    "disclaimers": {
      "title": "ڈس کلیمرز",
      "description": "ہماری سروس 'جیسا ہے' کی بنیاد پر فراہم کی جاتی ہے۔ ہم کسی بھی وارنٹی، ظاہری یا ضمنی، نہیں دیتے ہیں اور یہاں تمام دوسری وارنٹیوں کو مسترد کرتے ہیں بشمول:",
      "as_is": "سروس بغیر کسی وارنٹی کے فراہم کی جاتی ہے",
      "availability": "ہم غیر متوقع یا خرابی سے پاک سروس کی ضمانت نہیں دیتے",
      "accuracy": "ہم نتائج کی درستی یا مکمل ہونے کی ضمانت نہیں دیتے"
    },
    "limitation_liability": {
      "title": "ذمہ داری کی پابندی",
      "description": "کسی بھی صورت میں رنگ تبدیل کسی بھی غیر براہ راست، اتفاقی، خاص، نتیجہ خیز، یا سزاوار نقصانات کے لیے ذمہ دار نہیں ہوگا، جس میں محدودیت کے بغیر، منافع، ڈیٹا، استعمال، گڈ ول، یا دوسرے ناملمس نقصانات کا نقصان شامل ہے۔"
    },
    "termination": {
      "title": "خاتمہ",
      "description": "ہم کسی بھی وجہ سے، بغیر کسی پہلے اطلاع یا ذمہ داری کے، فوری طور پر آپ کی رسائی کو ختم یا معطل کر سکتے ہیں، جن میں شرائط کی خلاف ورزی شامل ہے لیکن ان تک محدود نہیں ہے۔"
    },
    "changes": {
      "title": "شرائط میں تبدیلیاں",
      "description": "ہم اپنی صرف ذمہ داری پر، کسی بھی وقت ان شرائط کو تبدیل یا تبدیل کرنے کا حق محفوظ رکھتے ہیں۔ اگر کوئی ترمیم اہم ہے، تو ہم کوشش کریں گے کہ کسی بھی نئی شرائط کے نافذ ہونے سے پہلے کم از کم 30 دن کی اطلاع دیں۔"
    },
    "governing_law": {
      "title": "گورننگ لاء",
      "description": "یہ شرائط قانون کے اختلاف کی شقیوں کو مد نظر رکھے بغیر، جس علاقے میں ہم کام کرتے ہیں اس کے قوانین کے مطابق تشریح اور governed ہوں گی۔"
    },
    "contact": {
      "title": "رابطے کی معلومات",
      "description": "اگر آپ کے پاس ان سروس کی شرائط کے بارے میں کوئی سوالات ہیں، تو براہ کرم ہم سے ہماری ویب سائٹ کے ذریعے رابطہ کریں۔"
    },
    "last_updated": "آخری بار اپ ڈیٹ کیا"
  },
  "Footer": {
    "rights_reserved": "تمام حقوق محفوظ ہیں۔",
    "privacy_policy": "رازداری کی پالیسی",
    "terms_of_service": "سروس کی شرائط"
  }
}