{
  "HomePage": {
    "title": "Công Cụ Thay Đổi Màu Ảnh - Trình Chỉnh Sửa Màu Trực Tuyến Miễn Phí",
    "originalImages": "Ảnh Gốc",
    "processedImages": "Ảnh Đã Xử Lý",
    "previewButton": "Xem Trước",
    "downloadButton": "Tải Xuống",
    "description": "Công cụ chuyên nghiệp trực tuyến để thay đổi màu ảnh. Thay đổi nhiều màu cùng lúc, xử lý hàng loạt ảnh và duy trì chất lượng. Xử lý cục bộ trên trình duyệt không cần tải lên. Lý tưởng cho nhà thiết kế, người bán thương mại điện tử và chuyên gia marketing.",
    "keywords": "thay đổi màu ảnh,chỉnh sửa ảnh online,thay đổi màu,xử lý hàng loạt,phần mềm chỉnh ảnh miễn phí,photoshop online,xóa nền,thiết kế đồ họa,chỉnh sửa ảnh,công cụ thiết kế"
  },
  "Header": {
    "title": "Thay Đổi Màu",
    "subtitle": "Công Cụ Chuyên Nghiệp Thay Đổi Màu Ảnh Trực Tuyến",
    "home": "Trang Chủ",
    "settings": "Cài Đặt",
    "about": "Giới Thiệu"
  },
  "ColorReplaceSettings": {
    "title": "Cài Đặt Thay Đổi Màu",
    "addColorPair": "Thêm Cặp Màu",
    "colorPairTitle": "Cặp Màu #{id}",
    "removeColorPair": "Xóa cặp màu này",
    "sourceColor": "Màu Nguồn",
    "targetColor": "Màu Đích",
    "toleranceLabel": "Độ Tương Đồng Màu: {value}%",
    "emptyState": "Chưa có quy tắc thay đổi màu. Nhấp \"Thêm Cặp Màu\" để bắt đầu",
    "toleranceTitle": "Độ Tương Đồng Màu",
    "toleranceLow": "Chính Xác",
    "toleranceHigh": "Tương Tự",
    "replace": "Thay Đổi",
    "download": "Tải Xuống",
    "clearFiles": "Xóa ảnh"
  },
  "ColorPicker": {
    "transparent": "trong suốt",
    "useTransparent": "Sử dụng trong suốt",
    "useColor": "Sử dụng màu"
  },
  "EyeDropper": {
    "tooltip": "Sử dụng bộ chọn màu"
  },
  "ToolDescription": {
    "title": "Công Cụ Thay Đổi Màu Ảnh Trực Tuyến Miễn Phí",
    "mainDescription": "Biến đổi hình ảnh của bạn ngay lập tức với công cụ chuyên nghiệp thay đổi màu. Hoàn hảo cho các nhà thiết kế, nhà tiếp thị và người tạo nội dung cần thay đổi màu sắc hình ảnh một cách nhanh chóng và hiệu quả. Cho dù bạn đang tạo các biến thể sản phẩm, điều chỉnh màu thương hiệu hay thử nghiệm các tùy chọn thiết kế, công cụ của chúng tôi cung cấp khả năng thao tác màu sắc chính xác trong khi vẫn giữ nguyên chất lượng hình ảnh - tất cả đều diễn ra trực tiếp trên trình duyệt của bạn, không cần tải lên.",
    "features": {
      "title": "Các Tính Năng Chuyên Nghiệp Cho Chỉnh Sửa Màu Ảnh",
      "feature1": {
        "title": "Công Nghệ Thay Đổi Màu Thông Minh",
        "description": "Thay đổi bất kỳ màu nào trong hình ảnh của bạn với độ chính xác từng điểm ảnh. Thuật toán khớp màu nâng cao của chúng tôi đảm bảo các chuyển đổi mượt mà và kết quả chuyên nghiệp, hoàn hảo cho ảnh sản phẩm và tài sản thiết kế."
      },
      "feature2": {
        "title": "Thay Đổi Nhiều Màu",
        "description": "Tiết kiệm thời gian bằng cách thay đổi nhiều màu đồng thời. Lý tưởng cho việc cập nhật màu thương hiệu, thay đổi chủ đề và tạo các biến thể sản phẩm. Thêm nhiều cặp màu để chuyển đổi toàn bộ bảng màu ngay lập tức."
      },
      "feature3": {
        "title": "Xử Lý Hàng Loạt Hiệu Quả",
        "description": "Xử lý nhiều hình ảnh đồng thời với tính năng xử lý hàng loạt mạnh mẽ của chúng tôi. Hoàn hảo cho ảnh sản phẩm thương mại điện tử, tài liệu tiếp thị và các dự án thiết kế lớn. Tiết kiệm hàng giờ thời gian chỉnh sửa thủ công."
      },
      "feature4": {
        "title": "Công Cụ Chọn Màu Chuyên Nghiệp",
        "description": "Sử dụng công cụ nhỏ giọt chính xác của chúng tôi để chọn màu chính xác từ hình ảnh. Tương thích với mã hex và giá trị RGB, giúp dễ dàng khớp màu thương hiệu một cách hoàn hảo."
      },
      "feature5": {
        "title": "Điều Khiển Khớp Màu Nâng Cao",
        "description": "Tinh chỉnh các thay đổi màu với các điều khiển tương tự thông minh của chúng tôi. Hoàn hảo để xử lý gradient, bóng và các biến đổi màu phức tạp trong khi vẫn duy trì kết quả tự nhiên."
      },
      "feature6": {
        "title": "Xử Lý Cục Bộ An Toàn",
        "description": "Trải nghiệm xử lý hình ảnh nhanh chóng, an toàn ngay trên trình duyệt của bạn. Không cần tải tệp - hình ảnh của bạn không bao giờ rời khỏi thiết bị, đảm bảo quyền riêng tư hoàn toàn và kết quả tức thì."
      }
    },
    "privacyTitle": "100% Riêng Tư & An Toàn",
    "privacyDescription": "Quyền riêng tư và an ninh dữ liệu của bạn là ưu tiên hàng đầu của chúng tôi. Không giống như các công cụ trực tuyến khác, bộ xử lý hình ảnh của chúng tôi hoạt động hoàn toàn trong trình duyệt của bạn - hình ảnh của bạn không bao giờ được tải lên bất kỳ máy chủ nào. Hãy tự tin làm việc, biết rằng các tài sản thiết kế nhạy cảm của bạn sẽ luôn riêng tư và an toàn trên thiết bị của bạn."
  },
  "UsageExamples": {
    "title": "Ví Dụ Sử Dụng",
    "description": "Dưới đây là một số ví dụ về cách sử dụng công cụ thay đổi màu:",
    "before": "Trước",
    "after": "Sau",
    "settingsTitle": "Cài Đặt Màu",
    "tolerance": "Độ Tương Đồng",
    "loadExample": "Tải Ví Dụ",
    "example1": {
      "title": "Cài Đặt Nhiều Cặp Màu",
      "description": "Thay đổi nhiều màu đồng thời bằng cách thêm nhiều cặp màu.",
      "beforeAlt": "Minh họa trạng thái trống với phối màu đỏ",
      "afterAlt": "Minh họa trạng thái trống với phối màu xanh"
    },
    "example2": {
      "title": "Xử Lý Hình Ảnh Hàng Loạt",
      "description": "Xử lý nhiều hình ảnh cùng một lúc để tối ưu hóa hiệu quả.",
      "beforeAlt": "Một bộ các biểu tượng màu xanh",
      "afterAlt": "Một bộ các biểu tượng màu đỏ"
    },
    "example3": {
      "title": "Thay Đổi Màu Thành Trong Suốt",
      "description": "Hỗ trợ thay đổi màu thành trong suốt.",
      "beforeAlt": "Ảnh đại diện với nền màu vàng",
      "afterAlt": "Ảnh đại diện với nền trong suốt"
    }
  },
  "Metadata": {
    "title": "Thay Đổi Màu - Công Cụ Thay Đổi Màu Ảnh Trực Tuyến Miễn Phí",
    "titleTemplate": "%s | Thay Đổi Màu - Trình Chỉnh Sửa Màu Ảnh",
    "description": "Công cụ trực tuyến miễn phí để thay đổi màu ảnh chính xác. Thay đổi nhiều màu đồng thời, xử lý hàng loạt hình ảnh và duy trì chất lượng. Không cần tải lên - xử lý cục bộ trên trình duyệt.",
    "keywords": [
      "thay đổi màu",
      "chỉnh sửa màu ảnh",
      "công cụ thay đổi màu",
      "xử lý ảnh hàng loạt",
      "thay đổi màu ảnh",
      "công cụ đổi màu",
      "chỉnh sửa ảnh",
      "công cụ thiết kế"
    ],
    "locale": "vi_VN",
    "ogTitle": "Thay Đổi Màu - Công Cụ Thay Đổi Màu Ảnh Trực Tuyến Miễn Phí",
    "ogDescription": "Biến đổi hình ảnh của bạn với công cụ thay đổi màu mạnh mẽ. Thay đổi nhiều màu, xử lý hàng loạt và duy trì chất lượng. Không cần tải lên - tất cả xử lý diễn ra trên trình duyệt của bạn.",
    "ogImageAlt": "Giao Diện Công Cụ Thay Đổi Màu",
    "twitterTitle": "Thay Đổi Màu - Công Cụ Thay Đổi Màu Ảnh Trực Tuyến Miễn Phí",
    "twitterDescription": "Biến đổi hình ảnh của bạn với công cụ thay đổi màu mạnh mẽ. Thay đổi nhiều màu, xử lý hàng loạt và duy trì chất lượng."
  },
  "ImageProcessor": {
    "dropToUpload": "Thả ảnh để tải lên",
    "dragAndDrop": "Kéo và thả ảnh vào đây",
    "supportedFormats": "Định dạng ảnh hoặc ảnh Ảnh hoặc ảnh GIF, PNG, JPG, JPEG, WEBP. Dung lượng tối đa 5MB cho mỗi tệp.",
    "error": {
      "fileTooLarge": "Tệp quá lớn, vui lòng tải lên ảnh duoi 5MB",
      "invalidFormat": "Vui lòng tải lên ảnh hoặc ảnh Ảnh hoặc ảnh GIF, PNG, JPG, JPEG, WEBP",
      "canvasContext": "Không thể tạo canvas context",
      "noFilesUploaded": "Chưa có ảnh nào được tải lên"
    }
  },
  "Privacy": {
    "title": "Chính Sách Quyền Riêng Tư",
    "description": "Chính sách quyền riêng tư cho công cụ thay đổi màu ảnh Color Replace",
    "keywords": "chính sách quyền riêng tư, bảo vệ dữ liệu, GDPR, quyền riêng tư người dùng, xử lý ảnh",
    "information_collection": {
      "title": "Thông Tin Chúng Tôi Thu Thập",
      "description": "Chúng tôi thu thập thông tin tối thiểu để cung cấp dịch vụ thay đổi màu:",
      "uploaded_images": "Ảnh bạn tải lên để thay đổi màu (được xử lý cục bộ trên trình duyệt của bạn)",
      "usage_data": "Thống kê sử dụng cơ bản và dữ liệu phân tích",
      "device_info": "Thông tin thiết bị và trình duyệt để tối ưu hóa dịch vụ"
    },
    "data_usage": {
      "title": "Cách Chúng Tôi Sử Dụng Dữ Liệu Của Bạn",
      "description": "Chúng tôi sử dụng thông tin thu thập được cho các mục đích sau:",
      "provide_service": "Để cung cấp và duy trì dịch vụ thay đổi màu của chúng tôi",
      "improve_service": "Để cải thiện và tối ưu hóa hiệu suất công cụ của chúng tôi",
      "analytics": "Để hiểu các mẫu sử dụng và cải thiện trải nghiệm người dùng",
      "advertising": "Để hiển thị quảng cáo liên quan thông qua Google AdSense"
    },
    "data_storage": {
      "title": "Lưu Trữ và Bảo Mật Dữ Liệu",
      "description": "Quyền riêng tư và an ninh dữ liệu của bạn là ưu tiên hàng đầu của chúng tôi:",
      "temporary": "Ảnh tải lên được xử lý cục bộ trên trình duyệt của bạn và không được lưu trữ trên máy chủ của chúng tôi"
    },
    "third_party": {
      "title": "Dịch Vụ Bên Thứ Ba",
      "description": "Chúng tôi sử dụng các dịch vụ bên thứ ba sau:",
      "analytics": "Để phân tích trang web và giám sát hiệu suất",
      "advertising": "Để hiển thị quảng cáo trên trang web của chúng tôi"
    },
    "cookies": {
      "title": "Cookie và Theo Dõi",
      "description": "Chúng tôi sử dụng cookie và công nghệ tương tự để nâng cao trải nghiệm của bạn và cung cấp phân tích.",
      "control": "Bạn có thể kiểm soát sở thích cookie thông qua cài đặt trình duyệt hoặc nền tảng quản lý sự đồng ý của chúng tôi."
    },
    "user_rights": {
      "title": "Quyền Của Bạn",
      "description": "Theo GDPR và các luật quyền riêng tư khác, bạn có các quyền sau:",
      "access": "Quyền truy cập dữ liệu cá nhân của bạn",
      "correction": "Quyền sửa chữa dữ liệu cá nhân không chính xác",
      "deletion": "Quyền yêu cầu xóa dữ liệu cá nhân của bạn",
      "portability": "Quyền di chuyển dữ liệu"
    },
    "contact": {
      "title": "Liên Hệ Chúng Tôi",
      "description": "Nếu bạn có bất kỳ câu hỏi nào về Chính Sách Quyền Riêng Tư này, vui lòng liên hệ chúng tôi qua trang web."
    },
    "updates": {
      "title": "Cập Nhật Chính Sách",
      "description": "Chúng tôi có thể cập nhật Chính Sách Quyền Riêng Tư này theo thời gian. Chúng tôi sẽ thông báo cho bạn về bất kỳ thay đổi nào bằng cách đăng Chính Sách Quyền Riêng Tư mới trên trang này."
    },
    "last_updated": "Cập nhật lần cuối"
  },
  "Terms": {
    "title": "Điều Khoản Dịch Vụ",
    "description": "Điều khoản dịch vụ cho công cụ thay đổi màu ảnh Color Replace",
    "keywords": "điều khoản dịch vụ, thỏa thuận người dùng, điều khoản và điều kiện, điều khoản dịch vụ",
    "acceptance": {
      "title": "Chấp Nhận Điều Khoản",
      "description": "Bằng cách truy cập và sử dụng công cụ Color Replace của chúng tôi, bạn chấp nhận và đồng ý bị ràng buộc bởi các điều khoản và điều khoản của thỏa thuận này."
    },
    "service_description": {
      "title": "Mô Tả Dịch Vụ",
      "description": "Color Replace là công cụ trực tuyến miễn phí cung cấp:",
      "color_replacement": "Khả năng thay đổi và chỉnh sửa màu ảnh",
      "image_processing": "Xử lý ảnh cục bộ mà không cần tải lên máy chủ",
      "free_service": "Truy cập miễn phí vào tất cả các tính năng thay đổi màu cơ bản"
    },
    "user_responsibilities": {
      "title": "Trách Nhiệm Người Dùng",
      "description": "Với tư cách là người dùng dịch vụ của chúng tôi, bạn đồng ý:",
      "legal_content": "Chỉ tải lên và xử lý ảnh mà bạn có quyền sử dụng hợp pháp",
      "copyright": "Tôn trọng quyền tác giả và sở hữu trí tuệ",
      "appropriate_use": "Chỉ sử dụng dịch vụ cho mục đích hợp pháp",
      "no_harmful_content": "Không tải lên nội dung có hại, gây xúc phạm hoặc không phù hợp"
    },
    "prohibited_uses": {
      "title": "Các Mục Đích Bị Cấm",
      "description": "Bạn không thể sử dụng dịch vụ của chúng tôi để:",
      "illegal_content": "Xử lý nội dung bất hợp pháp hoặc có hại",
      "copyright_violation": "Vi phạm quyền tác giả hoặc sở hữu trí tuệ",
      "malicious_use": "Bất kỳ hoạt động độc hại hoặc gây hại nào",
      "system_abuse": "Cố gắng lạm dụng hoặc quá tải hệ thống của chúng tôi"
    },
    "intellectual_property": {
      "title": "Sở Hữu Trí Tuệ",
      "description": "Công cụ Color Replace và nội dung, tính năng và chức năng gốc của nó thuộc sở hữu của chúng tôi và được bảo vệ bởi luật bản quyền quốc tế, nhãn hiệu và các luật sở hữu trí tuệ khác.",
      "user_content": "Bạn giữ lại tất cả các quyền đối với ảnh bạn tải lên và xử lý bằng công cụ của chúng tôi."
    },
    "disclaimers": {
      "title": "Từ Chối Trách Nhiệm",
      "description": "Dịch vụ của chúng tôi được cung cấp 'nguyên trạng'. Chúng tôi không đưa ra bất kỳ bảo đảm nào, dù là rõ ràng hay ngụ ý, và tại đây từ chối tất cả các bảo đảm khác bao gồm:",
      "as_is": "Dịch vụ được cung cấp mà không có bất kỳ loại bảo đảm nào",
      "availability": "Chúng tôi không đảm bảo dịch vụ không bị gián đoạn hoặc không có lỗi",
      "accuracy": "Chúng tôi không bảo đảm tính chính xác hoặc đầy đủ của kết quả"
    },
    "limitation_liability": {
      "title": "Giới Hạn Trách Nhiệm",
      "description": "Trong bất kỳ trường hợp nào, Color Replace sẽ không chịu trách nhiệm cho bất kỳ thiệt hại gián tiếp, ngẫu nhiên, đặc biệt, hậu quả hoặc trừng phạt nào, bao gồm nhưng không giới hạn, mất lợi nhuận, dữ liệu, sử dụng, uy tín hoặc các tổn thất vô hình khác."
    },
    "termination": {
      "title": "Chấm Dứt",
      "description": "Chúng tôi có thể chấm dứt hoặc đình chỉ quyền truy cập của bạn ngay lập tức, không cần thông báo hoặc trách nhiệm trước, cho bất kỳ lý do nào, bao gồm nhưng không giới hạn nếu bạn vi phạm Điều Khoản."
    },
    "changes": {
      "title": "Thay Đổi Điều Khoản",
      "description": "Chúng tôi bảo lưu quyền, theo sự quyết định duy nhất của mình, để sửa đổi hoặc thay thế các Điều Khoản này bất cứ lúc nào. Nếu một bản sửa đổi là quan trọng, chúng tôi sẽ cố gắng cung cấp thông báo trước ít nhất 30 ngày trước khi các điều khoản mới có hiệu lực."
    },
    "governing_law": {
      "title": "Luật Áp Dụng",
      "description": "Các Điều Khoản này sẽ được giải thích và chi phối bởi luật pháp của khu vực tài phán nơi chúng tôi hoạt động, không quan tâm đến các quy định về xung đột luật pháp của nó."
    },
    "contact": {
      "title": "Thông Tin Liên Hệ",
      "description": "Nếu bạn có bất kỳ câu hỏi nào về các Điều Khoản Dịch Vụ này, vui lòng liên hệ chúng tôi qua trang web."
    },
    "last_updated": "Cập nhật lần cuối"
  },
  "Footer": {
    "rights_reserved": "Mọi quyền được bảo lưu.",
    "privacy_policy": "Chính Sách Quyền Riêng Tư",
    "terms_of_service": "Điều Khoản Dịch Vụ"
  }
}